-- 基础信息
local base_info = {
	group_id = 133604048
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 48053 , gadget_id = 73065004 , pos = { x = 2379.001, y = 212.387, z = 9218.205 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48054 , gadget_id = 73065004 , pos = { x = 2377.736, y = 211.718, z = 9219.46 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48055 , gadget_id = 73065004 , pos = { x = 2358.435, y = 210.58, z = 9235.723 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48056 , gadget_id = 73065004 , pos = { x = 2373.146, y = 212.544, z = 9228.791 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48057 , gadget_id = 73065004 , pos = { x = 2373.392, y = 212.026, z = 9228.328 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48058 , gadget_id = 73065004 , pos = { x = 2359.596, y = 210.07, z = 9234.336 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48060 , gadget_id = 73065004 , pos = { x = 2377.215, y = 212.117, z = 9216.563 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48061 , gadget_id = 73065004 , pos = { x = 2357.418, y = 210.401, z = 9236.538 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48063 , gadget_id = 73065004 , pos = { x = 2467.504, y = 313.534, z = 9255.253 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48064 , gadget_id = 73065004 , pos = { x = 2547.324, y = 344.179, z = 9228.337 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48074 , gadget_id = 73065004 , pos = { x = 2462.724, y = 201.384, z = 9266.863 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48079 , gadget_id = 73065003 , pos = { x = 2343.151, y = 215.482, z = 9239.363 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48080 , gadget_id = 73065003 , pos = { x = 2340.929, y = 214.245, z = 9240.371 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48081 , gadget_id = 73065003 , pos = { x = 2342.431, y = 214.738, z = 9238.676 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48082 , gadget_id = 73065003 , pos = { x = 2338.38, y = 214.783, z = 9241.877 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48083 , gadget_id = 73065003 , pos = { x = 2346.182, y = 215.309, z = 9239.314 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48084 , gadget_id = 73065003 , pos = { x = 2344.2, y = 215.489, z = 9238.035 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48085 , gadget_id = 73065003 , pos = { x = 2343.91, y = 216.876, z = 9237.338 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48086 , gadget_id = 73065003 , pos = { x = 2341.554, y = 215.511, z = 9239.027 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48108 , gadget_id = 73045151 , pos = { x = 2343.411, y = 213.096, z = 9239.839 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48109 , gadget_id = 73045151 , pos = { x = 2341.08, y = 212.846, z = 9240.65 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48110 , gadget_id = 73045151 , pos = { x = 2342.599, y = 213.18, z = 9238.986 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48111 , gadget_id = 73045151 , pos = { x = 2338.6, y = 212.727, z = 9242.289 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48112 , gadget_id = 73045151 , pos = { x = 2346.46, y = 212.769, z = 9239.816 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48113 , gadget_id = 73045151 , pos = { x = 2344.464, y = 213.102, z = 9238.503 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48114 , gadget_id = 73045151 , pos = { x = 2352.822, y = 217.814, z = 9217.148 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48115 , gadget_id = 73045151 , pos = { x = 2344.31, y = 212.67, z = 9239.12 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48116 , gadget_id = 73045151 , pos = { x = 2341.784, y = 213.1, z = 9240.049 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48117 , gadget_id = 73045226 , pos = { x = 2378.762, y = 211.072, z = 9218.151 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48118 , gadget_id = 73045226 , pos = { x = 2377.559, y = 210.74, z = 9219.418 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48119 , gadget_id = 73045226 , pos = { x = 2358.182, y = 209.128, z = 9235.671 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48120 , gadget_id = 73045226 , pos = { x = 2372.963, y = 211.384, z = 9228.741 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48121 , gadget_id = 73045226 , pos = { x = 2373.26, y = 211.185, z = 9228.292 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48122 , gadget_id = 73045226 , pos = { x = 2359.38, y = 208.843, z = 9234.292 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48127 , gadget_id = 73045226 , pos = { x = 2466.937, y = 311.666, z = 9256.205 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48129 , gadget_id = 73045226 , pos = { x = 2377.537, y = 209.171, z = 9217.041 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48130 , gadget_id = 73045226 , pos = { x = 2357.58, y = 208.742, z = 9236.839 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 48131 , gadget_id = 73065003 , pos = { x = 2352.555, y = 220.614, z = 9216.58 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 48053,48054,48055,48056,48057,48058,48060,48061,48063,48064,48074,48079,48080,48081,48082,48083,48084,48085,48086,48108,48109,48110,48111,48112,48113,48114,48115,48116,48117,48118,48119,48120,48121,48122,48127,48129,48130,48131 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
