-- 基础信息
local base_info = {
	group_id = 133611408
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 408023 , monster_id = 35550506 , pos = { x = 5868.051, y = 203.086, z = 9492.079 } , rot = { x = 0, y = 84.734, z = 0 } , level = 90 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 408031 , monster_id = 22130103 , pos = { x = 5873.765, y = 201.543, z = 9489.14 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 408032 , monster_id = 22130104 , pos = { x = 5867.261, y = 201.635, z = 9487.486 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 408001 , gadget_id = 73074051 , pos = { x = 5857.646, y = 201.624, z = 9500.552 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 408012 , gadget_id = 73074075 , pos = { x = 5860.98, y = 211.302, z = 9504.3 } , rot = { x = 0, y = 17.538, z = 0 } , level = 93 },
	{ config_id = 408015 , gadget_id = 70211022 , pos = { x = 5876.617, y = 203.05, z = 9497.352 } , rot = { x = 0, y = 193.53, z = 0 } , level = 88 },
	{ config_id = 408017 , gadget_id = 73074076 , pos = { x = 5858.78, y = 201.646, z = 9498.696 } , rot = { x = 0, y = 6.195, z = 0 } , level = 93 },
	{ config_id = 408043 , gadget_id = 42215010 , pos = { x = 5867.284, y = 201.343, z = 9489.657 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 408023,408031,408032 },
		gadgets = { 408001,408012,408015,408017,408043 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
