-- 基础信息
local base_info = {
	group_id = 133607229
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 229270 , gadget_id = 73065004 , pos = { x = 1809.008, y = 215.746, z = 9607.456 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229271 , gadget_id = 73065004 , pos = { x = 1809.65, y = 214.959, z = 9607.34 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229272 , gadget_id = 73065004 , pos = { x = 1809.044, y = 214.784, z = 9609.413 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229273 , gadget_id = 73065004 , pos = { x = 1810.869, y = 216.521, z = 9621.754 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229274 , gadget_id = 73065004 , pos = { x = 1811.722, y = 215.933, z = 9621.235 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229275 , gadget_id = 73065004 , pos = { x = 1793.826, y = 219.024, z = 9630.698 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229289 , gadget_id = 73065004 , pos = { x = 1816.65, y = 224.69, z = 9649.18 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229294 , gadget_id = 73065004 , pos = { x = 1822.172, y = 216.298, z = 9597.501 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229302 , gadget_id = 73065004 , pos = { x = 1921.218, y = 203.194, z = 9726.099 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229303 , gadget_id = 73065004 , pos = { x = 1920.749, y = 202.891, z = 9723.719 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229304 , gadget_id = 73065004 , pos = { x = 1936.686, y = 202.887, z = 9702.295 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229319 , gadget_id = 73065004 , pos = { x = 1822.47, y = 218.905, z = 9597.916 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229321 , gadget_id = 73065004 , pos = { x = 1918.682, y = 203.927, z = 9722.016 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229323 , gadget_id = 73065004 , pos = { x = 1934.963, y = 203.495, z = 9701.32 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229336 , gadget_id = 73065004 , pos = { x = 1991.495, y = 202.359, z = 9712.553 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229337 , gadget_id = 73065004 , pos = { x = 2002.448, y = 201.604, z = 9718.821 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229340 , gadget_id = 73065004 , pos = { x = 1801.603, y = 220.419, z = 9639.936 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229341 , gadget_id = 73065004 , pos = { x = 1817.124, y = 218.775, z = 9618.52 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229344 , gadget_id = 73065004 , pos = { x = 1800.075, y = 221.829, z = 9639.681 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229351 , gadget_id = 73065004 , pos = { x = 1796.32, y = 236.658, z = 9706.446 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229352 , gadget_id = 73065004 , pos = { x = 1796.319, y = 236.378, z = 9684.527 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229353 , gadget_id = 73065004 , pos = { x = 1792.064, y = 238.78, z = 9710.702 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229360 , gadget_id = 73065004 , pos = { x = 1794.91, y = 236.842, z = 9707.471 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229361 , gadget_id = 73065004 , pos = { x = 1797.269, y = 236.914, z = 9683.91 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229362 , gadget_id = 73065003 , pos = { x = 1838.507, y = 228.874, z = 9633.729 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229463 , gadget_id = 73065004 , pos = { x = 1813.568, y = 230.245, z = 9664.387 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229465 , gadget_id = 73065004 , pos = { x = 1758.676, y = 245.089, z = 9733.539 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229466 , gadget_id = 73065004 , pos = { x = 1790.043, y = 236.412, z = 9690.304 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229467 , gadget_id = 73045151 , pos = { x = 1838.78, y = 226.37, z = 9634.58 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229468 , gadget_id = 73045151 , pos = { x = 1843.033, y = 227.702, z = 9608.047 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229478 , gadget_id = 73045226 , pos = { x = 1808.73, y = 214.13, z = 9607.375 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229479 , gadget_id = 73045226 , pos = { x = 1809.48, y = 213.97, z = 9607.29 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229480 , gadget_id = 73045226 , pos = { x = 1808.854, y = 213.68, z = 9609.357 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229481 , gadget_id = 73045226 , pos = { x = 1810.608, y = 214.901, z = 9621.689 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229482 , gadget_id = 73045226 , pos = { x = 1811.535, y = 214.779, z = 9621.186 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229483 , gadget_id = 73045226 , pos = { x = 1793.636, y = 217.938, z = 9630.661 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229497 , gadget_id = 73045226 , pos = { x = 1816.44, y = 223.4, z = 9649.13 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229502 , gadget_id = 73045226 , pos = { x = 1821.895, y = 214.999, z = 9597.44 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229504 , gadget_id = 73045226 , pos = { x = 1813.36, y = 230.13, z = 9664.16 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229511 , gadget_id = 73045226 , pos = { x = 1920.951, y = 201.512, z = 9726.023 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229512 , gadget_id = 73045226 , pos = { x = 1920.52, y = 201.48, z = 9723.66 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229513 , gadget_id = 73045226 , pos = { x = 1936.483, y = 201.662, z = 9702.25 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229528 , gadget_id = 73045226 , pos = { x = 1822.785, y = 215.97, z = 9598.46 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229530 , gadget_id = 73045226 , pos = { x = 1918.96, y = 201.14, z = 9722.74 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 229532 , gadget_id = 73045226 , pos = { x = 1935.16, y = 201.81, z = 9701.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 229270,229271,229272,229273,229274,229275,229289,229294,229302,229303,229304,229319,229321,229323,229336,229337,229340,229341,229344,229351,229352,229353,229360,229361,229362,229463,229465,229466,229467,229468,229478,229479,229480,229481,229482,229483,229497,229502,229504,229511,229512,229513,229528,229530,229532 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
