-- 基础信息
local base_info = {
	group_id = 133606057
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 57001 , monster_id = 20011001 , pos = { x = 1916.367, y = 200.292, z = 10931.48 } , rot = { x = 0, y = 228.971, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 57004 , monster_id = 20011001 , pos = { x = 1907.393, y = 200.114, z = 10932.88 } , rot = { x = 0, y = 4.783, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 57005 , monster_id = 26300301 , pos = { x = 1916.745, y = 200.112, z = 10935.19 } , rot = { x = 0, y = 147.159, z = 0 } , level = 90 , title_id = 8136, special_name_id = 2813801 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 57001,57004,57005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
