-- 基础信息
local base_info = {
	group_id = 133601224
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 224001 , monster_id = 23079301 , pos = { x = 3594.414, y = 237.879, z = 9931.668 } , rot = { x = 0, y = 228.187, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741901 },
	{ config_id = 224002 , monster_id = 23074102 , pos = { x = 3590.528, y = 236.722, z = 9929.913 } , rot = { x = 0, y = 50.33, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 224003 , monster_id = 23074102 , pos = { x = 3591.681, y = 236.722, z = 9928.119 } , rot = { x = 0, y = 50.686, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 224005 , gadget_id = 42308099 , pos = { x = 3592.315, y = 236.722, z = 9929.985 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 224001,224002,224003 },
		gadgets = { 224005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
