-- 基础信息
local base_info = {
	group_id = 133601319
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 319001 , monster_id = 23080301 , pos = { x = 3606.751, y = 202.481, z = 9907.161 } , rot = { x = 0, y = 90, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 },
	{ config_id = 319002 , monster_id = 23080301 , pos = { x = 3606.751, y = 202.496, z = 9910.626 } , rot = { x = 0, y = 90, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 319004 , gadget_id = 73073047 , pos = { x = 3612.46, y = 202.5, z = 9894.262 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 319005 , gadget_id = 42308099 , pos = { x = 3616.402, y = 200, z = 9901.997 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 319001,319002 },
		gadgets = { 319004,319005 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
