-- 基础信息
local base_info = {
	group_id = 133601160
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 160020 , monster_id = 22130002 , pos = { x = 2771.222, y = 261.72, z = 9060.291 } , rot = { x = 0, y = 87.913, z = 0 } , level = 88 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 160021 , monster_id = 22130002 , pos = { x = 2776.312, y = 261.161, z = 9055.354 } , rot = { x = 0, y = 9.174, z = 0 } , level = 88 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 160022 , monster_id = 22130101 , pos = { x = 2771.995, y = 262.105, z = 9054.361 } , rot = { x = 0, y = 55.64, z = 0 } , level = 88 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 160002 , gadget_id = 70220226 , pos = { x = 2768.077, y = 262.995, z = 9055.464 } , rot = { x = 0, y = 48.39, z = 0 } , level = 89 },
	{ config_id = 160025 , gadget_id = 73073027 , pos = { x = 2774.305, y = 261.076, z = 9062.216 } , rot = { x = 12.836, y = 82.087, z = 356.473 } , level = 87 },
	{ config_id = 160026 , gadget_id = 73073025 , pos = { x = 2776.888, y = 261.284, z = 9054.305 } , rot = { x = 351.963, y = 161, z = 11.957 } , level = 87 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 160020,160021,160022 },
		gadgets = { 160002,160025,160026 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
