-- 基础信息
local base_info = {
	group_id = 133611486
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 486003 , monster_id = 22130001 , pos = { x = 5621.157, y = 228.849, z = 9852.642 } , rot = { x = 0, y = 219.723, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 486004 , monster_id = 22130102 , pos = { x = 5632.716, y = 228.945, z = 9845.357 } , rot = { x = 0, y = 230.788, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 486005 , monster_id = 22130201 , pos = { x = 5624.633, y = 228.003, z = 9848.121 } , rot = { x = 0, y = 254.974, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 486021 , monster_id = 22131001 , pos = { x = 5627.85, y = 227.945, z = 9845.223 } , rot = { x = 0, y = 214.916, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408801 },
	{ config_id = 486023 , monster_id = 22130001 , pos = { x = 5619.668, y = 226.358, z = 9846.782 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 486024 , monster_id = 22130102 , pos = { x = 5626.289, y = 226.471, z = 9841.188 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 486001 , gadget_id = 73074051 , pos = { x = 5622.4, y = 228.291, z = 9851.954 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 486012 , gadget_id = 73074075 , pos = { x = 5625.244, y = 242.872, z = 9850.685 } , rot = { x = 0, y = 17.538, z = 0 } , level = 93 },
	{ config_id = 486014 , gadget_id = 73074077 , pos = { x = 5625.545, y = 229.245, z = 9851.209 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 486015 , gadget_id = 70211021 , pos = { x = 5622.934, y = 229.417, z = 9852.946 } , rot = { x = 3.822, y = 207.267, z = 0.32 } , level = 88 },
	{ config_id = 486017 , gadget_id = 73074076 , pos = { x = 5625.85, y = 228.41, z = 9851 } , rot = { x = 0, y = 306.433, z = 0 } , level = 93 },
	{ config_id = 486026 , gadget_id = 73074092 , pos = { x = 5623.518, y = 226.489, z = 9844.034 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 486027 , gadget_id = 73070014 , pos = { x = 5614.178, y = 225.169, z = 9845.771 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 486003,486004,486005,486021,486023,486024 },
		gadgets = { 486001,486012,486014,486015,486017,486026,486027 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
