-- 基础信息
local base_info = {
	group_id = 133602029
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 29001 , monster_id = 21010201 , pos = { x = 3437.258, y = 197.75, z = 9529.561 } , rot = { x = 0, y = 75.234, z = 0 } , level = 91 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 29004 , monster_id = 21010201 , pos = { x = 3430.07, y = 197.75, z = 9535.918 } , rot = { x = 0, y = 72.166, z = 0 } , level = 91 , title_id = 3001, special_name_id = 2300101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 29001,29004 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
