-- 基础信息
local base_info = {
	group_id = 133602008
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 8001 , monster_id = 23085301 , pos = { x = 3137.777, y = 202.07, z = 9298.807 } , rot = { x = 0, y = 307.178, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742801 },
	{ config_id = 8004 , monster_id = 23080301 , pos = { x = 3128.358, y = 202.07, z = 9306.709 } , rot = { x = 0, y = 125.48, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 },
	{ config_id = 8005 , monster_id = 23080102 , pos = { x = 3125.854, y = 202.07, z = 9303.094 } , rot = { x = 0, y = 125.387, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 8006 , gadget_id = 42308099 , pos = { x = 3132.198, y = 202.07, z = 9300.595 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 8001,8004,8005 },
		gadgets = { 8006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
