-- 基础信息
local base_info = {
	group_id = 133611254
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 254001 , monster_id = 22130101 , pos = { x = 5673.181, y = 218.524, z = 9978.267 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 254002 , monster_id = 22130002 , pos = { x = 5673.78, y = 216.247, z = 9986.205 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 254004 , monster_id = 22130101 , pos = { x = 5686.585, y = 215.947, z = 9979.265 } , rot = { x = 0, y = 100.922, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 254003 , gadget_id = 73004070 , pos = { x = 5676.553, y = 211.318, z = 9977.251 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 254013 , gadget_id = 70211012 , pos = { x = 5677.924, y = 216.346, z = 9986.324 } , rot = { x = 358.637, y = 171.983, z = 1.723 } , level = 88 },
	{ config_id = 254015 , gadget_id = 73070063 , pos = { x = 5675.351, y = 218.029, z = 9979.764 } , rot = { x = 341.824, y = 0.307, z = 358.083 } , level = 93 },
	{ config_id = 254016 , gadget_id = 73070034 , pos = { x = 5675.302, y = 218.188, z = 9979.817 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 254018 , gadget_id = 73080008 , pos = { x = 5672.034, y = 216.217, z = 9986.535 } , rot = { x = 0, y = 101.984, z = 3.704 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 254001,254002,254004 },
		gadgets = { 254003,254013,254015,254016,254018 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
