-- 基础信息
local base_info = {
	group_id = 133601241
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 241001 , monster_id = 23080501 , pos = { x = 3096.952, y = 204.19, z = 9782.894 } , rot = { x = 0, y = 230, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 241002 , monster_id = 23080501 , pos = { x = 3098.559, y = 204.19, z = 9780.979 } , rot = { x = 0, y = 230, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 241003 , gadget_id = 42308099 , pos = { x = 3096.886, y = 204.2, z = 9781.508 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 241001,241002 },
		gadgets = { 241003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
