-- 基础信息
local base_info = {
	group_id = 133601292
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 292001 , monster_id = 23080501 , pos = { x = 3473.708, y = 249.183, z = 9539.858 } , rot = { x = 0, y = 315.489, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 292002 , monster_id = 23080501 , pos = { x = 3471.33, y = 249.161, z = 9537.521 } , rot = { x = 0, y = 315.489, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 292003 , gadget_id = 42308099 , pos = { x = 3471.367, y = 248.002, z = 9540.173 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 292001,292002 },
		gadgets = { 292003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
