-- 基础信息
local base_info = {
	group_id = 133611163
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 163012 , monster_id = 21010201 , pos = { x = 5486.585, y = 228.736, z = 9530.577 } , rot = { x = 0, y = 82.098, z = 0 } , level = 88 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 163013 , monster_id = 21010201 , pos = { x = 5486.829, y = 228.921, z = 9528.549 } , rot = { x = 0, y = 66.085, z = 0 } , level = 88 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 163014 , monster_id = 21010201 , pos = { x = 5488.906, y = 228.645, z = 9534.293 } , rot = { x = 0, y = 134.289, z = 0 } , level = 88 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 163015 , monster_id = 21020201 , pos = { x = 5483.572, y = 228.389, z = 9533.917 } , rot = { x = 0, y = 78.372, z = 0 } , level = 88 , title_id = 3102, special_name_id = 2310107 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 163012,163013,163014,163015 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
