-- 基础信息
local base_info = {
	group_id = 133604020
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 20005 , monster_id = 26300301 , pos = { x = 2179.406, y = 200, z = 8918.673 } , rot = { x = 0, y = 0, z = 0 } , level = 88 , title_id = 8136, special_name_id = 2813801 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 20005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
