-- 基础信息
local base_info = {
	group_id = 133601157
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 157004 , monster_id = 22130101 , pos = { x = 3473.375, y = 201.378, z = 9675.486 } , rot = { x = 0, y = 0, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 157005 , monster_id = 22130002 , pos = { x = 3470.529, y = 201.13, z = 9680.54 } , rot = { x = 0, y = 55.787, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 157004,157005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
