-- 基础信息
local base_info = {
	group_id = 133606068
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 68001 , monster_id = 20011001 , pos = { x = 2069.375, y = 230.91, z = 10755.35 } , rot = { x = 0, y = 300.031, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 68004 , monster_id = 20011001 , pos = { x = 2070.817, y = 231.093, z = 10757.04 } , rot = { x = 0, y = 270.354, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 68005 , monster_id = 20011101 , pos = { x = 2068.505, y = 230.91, z = 10758.33 } , rot = { x = 0, y = 157.969, z = 0 } , level = 90 , title_id = 1051, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 68001,68004,68005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
