-- 基础信息
local base_info = {
	group_id = 133601052
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 52001 , monster_id = 23079201 , pos = { x = 3623.548, y = 202.5, z = 9863.43 } , rot = { x = 0, y = 270, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741801 },
	{ config_id = 52005 , monster_id = 23078102 , pos = { x = 3619.336, y = 202.5, z = 9865.027 } , rot = { x = 0, y = 90, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741601 },
	{ config_id = 52006 , monster_id = 23078102 , pos = { x = 3619.336, y = 202.5, z = 9862.035 } , rot = { x = 0, y = 90, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741601 },
	{ config_id = 52007 , monster_id = 23080501 , pos = { x = 3618.567, y = 202.5, z = 9854.193 } , rot = { x = 0, y = 0, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 52008 , gadget_id = 42308099 , pos = { x = 3617.71, y = 202.366, z = 9860.967 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 52001,52005,52006,52007 },
		gadgets = { 52008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
