-- 基础信息
local base_info = {
	group_id = 133607233
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 233181 , gadget_id = 73065004 , pos = { x = 1895.218, y = 236.301, z = 9393.914 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233182 , gadget_id = 73065004 , pos = { x = 1859.049, y = 238.75, z = 9386.383 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233192 , gadget_id = 73065004 , pos = { x = 1898.387, y = 237.708, z = 9285.173 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233193 , gadget_id = 73065004 , pos = { x = 1897, y = 236.919, z = 9284.176 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233194 , gadget_id = 73065004 , pos = { x = 1876.302, y = 244.308, z = 9259.899 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233195 , gadget_id = 73065004 , pos = { x = 1875.099, y = 237.271, z = 9323.705 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233196 , gadget_id = 73065004 , pos = { x = 1857.796, y = 236.223, z = 9405.24 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233199 , gadget_id = 73065004 , pos = { x = 1826.232, y = 256.794, z = 9346.76 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233200 , gadget_id = 73065004 , pos = { x = 1825.913, y = 256.133, z = 9345.526 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233201 , gadget_id = 73065004 , pos = { x = 1814.338, y = 261.697, z = 9337.401 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233202 , gadget_id = 73065004 , pos = { x = 1823.425, y = 256.381, z = 9343.28 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233204 , gadget_id = 73065004 , pos = { x = 1916.016, y = 250.591, z = 9224.449 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233205 , gadget_id = 73065004 , pos = { x = 1916.974, y = 249.952, z = 9224.754 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233206 , gadget_id = 73065004 , pos = { x = 1937.547, y = 247.759, z = 9234.262 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233208 , gadget_id = 73065004 , pos = { x = 1904.577, y = 236.633, z = 9310.573 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233210 , gadget_id = 73065004 , pos = { x = 1914.651, y = 256.104, z = 9308.439 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233212 , gadget_id = 73065004 , pos = { x = 1924.83, y = 245.369, z = 9345.563 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233213 , gadget_id = 73065004 , pos = { x = 1973.107, y = 240.954, z = 9329.569 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233214 , gadget_id = 73065004 , pos = { x = 1931.603, y = 258.448, z = 9304.057 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233215 , gadget_id = 73065004 , pos = { x = 1930.414, y = 257.751, z = 9304.189 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233216 , gadget_id = 73065004 , pos = { x = 1930.188, y = 258.298, z = 9304.187 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233217 , gadget_id = 73065004 , pos = { x = 1914.5, y = 255.323, z = 9312.53 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233220 , gadget_id = 73065004 , pos = { x = 1924.043, y = 245.822, z = 9348.72 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233221 , gadget_id = 73065004 , pos = { x = 1983.28, y = 240.249, z = 9322.061 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233222 , gadget_id = 73065003 , pos = { x = 2040.822, y = 290.615, z = 9289.299 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233223 , gadget_id = 73065003 , pos = { x = 2043.518, y = 290.277, z = 9293.017 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233230 , gadget_id = 73065003 , pos = { x = 2034.457, y = 270.429, z = 9367.498 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233233 , gadget_id = 73065003 , pos = { x = 2025.22, y = 275.841, z = 9343.23 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233235 , gadget_id = 73065003 , pos = { x = 2041.366, y = 291.436, z = 9288.193 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233239 , gadget_id = 73065003 , pos = { x = 2023.488, y = 276.112, z = 9342.794 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233313 , gadget_id = 73045151 , pos = { x = 2041.237, y = 288.535, z = 9289.51 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233314 , gadget_id = 73045151 , pos = { x = 2043.669, y = 288.493, z = 9293.403 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233315 , gadget_id = 73045151 , pos = { x = 1994.061, y = 278.667, z = 9320.571 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233316 , gadget_id = 73045151 , pos = { x = 1993.181, y = 278.139, z = 9320.678 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233323 , gadget_id = 73045151 , pos = { x = 2034.66, y = 268.51, z = 9367.88 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233326 , gadget_id = 73045151 , pos = { x = 2025.457, y = 273.68, z = 9343.647 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233328 , gadget_id = 73045151 , pos = { x = 2041.602, y = 288.051, z = 9289.352 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233332 , gadget_id = 73045151 , pos = { x = 2023.689, y = 273.12, z = 9344.111 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233336 , gadget_id = 73045226 , pos = { x = 1895.001, y = 235.266, z = 9393.849 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233337 , gadget_id = 73045226 , pos = { x = 1858.81, y = 237.72, z = 9386.33 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233347 , gadget_id = 73045226 , pos = { x = 1898.114, y = 236.027, z = 9285.095 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233348 , gadget_id = 73045226 , pos = { x = 1896.825, y = 235.85, z = 9284.126 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233349 , gadget_id = 73045226 , pos = { x = 1876.01, y = 242.63, z = 9259.84 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233350 , gadget_id = 73045226 , pos = { x = 1874.811, y = 235.592, z = 9323.648 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233351 , gadget_id = 73045226 , pos = { x = 1857.66, y = 235.383, z = 9405.2 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233354 , gadget_id = 73045226 , pos = { x = 1825.958, y = 255.113, z = 9346.682 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233355 , gadget_id = 73045226 , pos = { x = 1825.733, y = 255.031, z = 9345.476 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233356 , gadget_id = 73045226 , pos = { x = 1814.04, y = 260.02, z = 9337.34 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233357 , gadget_id = 73045226 , pos = { x = 1823.259, y = 255.42, z = 9343.245 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233359 , gadget_id = 73045226 , pos = { x = 1915.73, y = 248.912, z = 9224.393 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233360 , gadget_id = 73045226 , pos = { x = 1916.757, y = 248.682, z = 9224.711 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233361 , gadget_id = 73045226 , pos = { x = 1937.364, y = 246.483, z = 9234.229 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 233363 , gadget_id = 73045226 , pos = { x = 1904.366, y = 235.288, z = 9310.518 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 233181,233182,233192,233193,233194,233195,233196,233199,233200,233201,233202,233204,233205,233206,233208,233210,233212,233213,233214,233215,233216,233217,233220,233221,233222,233223,233230,233233,233235,233239,233313,233314,233315,233316,233323,233326,233328,233332,233336,233337,233347,233348,233349,233350,233351,233354,233355,233356,233357,233359,233360,233361,233363 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
