-- 基础信息
local base_info = {
	group_id = 133601049
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 49148 , gadget_id = 73065004 , pos = { x = 3376.148, y = 236.233, z = 9573.728 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49149 , gadget_id = 73065004 , pos = { x = 3415.606, y = 228.294, z = 9591.641 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49150 , gadget_id = 73065004 , pos = { x = 3439.568, y = 223.889, z = 9599.402 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49151 , gadget_id = 73065004 , pos = { x = 3400.375, y = 231.813, z = 9584.024 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49152 , gadget_id = 73065004 , pos = { x = 3419.972, y = 236.33, z = 9570.221 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49159 , gadget_id = 73065004 , pos = { x = 3438.43, y = 199.036, z = 9568.25 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49160 , gadget_id = 73065004 , pos = { x = 3434.436, y = 199.587, z = 9590.378 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49162 , gadget_id = 73065004 , pos = { x = 3437.851, y = 200.909, z = 9599.742 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49167 , gadget_id = 73065004 , pos = { x = 3404.577, y = 205.813, z = 9626.65 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49169 , gadget_id = 73065004 , pos = { x = 3375.331, y = 236.971, z = 9572.838 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49170 , gadget_id = 73065004 , pos = { x = 3414.806, y = 229.619, z = 9592.245 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49175 , gadget_id = 73065004 , pos = { x = 3439.306, y = 200.82, z = 9567.035 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49184 , gadget_id = 73065004 , pos = { x = 3430.497, y = 203.284, z = 9551.477 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49251 , gadget_id = 73045226 , pos = { x = 3375.985, y = 235.267, z = 9573.678 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49252 , gadget_id = 73045226 , pos = { x = 3415.372, y = 226.903, z = 9591.588 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49253 , gadget_id = 73045226 , pos = { x = 3439.3, y = 222.503, z = 9599.378 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49254 , gadget_id = 73045226 , pos = { x = 3400.215, y = 230.847, z = 9583.979 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49255 , gadget_id = 73045226 , pos = { x = 3419.814, y = 235.364, z = 9570.17 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49262 , gadget_id = 73045226 , pos = { x = 3438.258, y = 197.968, z = 9568.201 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49263 , gadget_id = 73045226 , pos = { x = 3434.282, y = 198.648, z = 9590.337 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49265 , gadget_id = 73045226 , pos = { x = 3437.712, y = 199.839, z = 9599.281 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49270 , gadget_id = 73045226 , pos = { x = 3404.833, y = 203.271, z = 9627.098 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49272 , gadget_id = 73045226 , pos = { x = 3375.522, y = 235.452, z = 9573.232 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49273 , gadget_id = 73045226 , pos = { x = 3415.021, y = 227.415, z = 9592.6 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 49279 , gadget_id = 73045226 , pos = { x = 3439.56, y = 198.301, z = 9567.482 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 49148,49149,49150,49151,49152,49159,49160,49162,49167,49169,49170,49175,49184,49251,49252,49253,49254,49255,49262,49263,49265,49270,49272,49273,49279 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
