-- 基础信息
local base_info = {
	group_id = 133601146
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 146001 , monster_id = 23079202 , pos = { x = 3129.965, y = 212.997, z = 9492.9 } , rot = { x = 0, y = 243.836, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741801 },
	{ config_id = 146002 , monster_id = 23080501 , pos = { x = 3131.133, y = 218.377, z = 9486.009 } , rot = { x = 0, y = 276.174, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 146003 , gadget_id = 42308099 , pos = { x = 3129.722, y = 212.935, z = 9492.724 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 146001,146002 },
		gadgets = { 146003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
