-- 基础信息
local base_info = {
	group_id = 133610006
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 6001 , gadget_id = 73070063 , pos = { x = 6220.694, y = 216.704, z = 10032.92 } , rot = { x = 0, y = 203.568, z = 0 } , level = 93 },
	{ config_id = 6012 , gadget_id = 73074008 , pos = { x = 6199.31, y = 215.77, z = 10018.25 } , rot = { x = 0, y = 91, z = 0 } , level = 93 },
	{ config_id = 6014 , gadget_id = 73074045 , pos = { x = 6200.755, y = 215.746, z = 10020.11 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6015 , gadget_id = 70310148 , pos = { x = 6200.755, y = 215.746, z = 10020.11 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6017 , gadget_id = 73070063 , pos = { x = 6202.297, y = 217.269, z = 10019.46 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6018 , gadget_id = 70211012 , pos = { x = 6198.778, y = 216.759, z = 10018.28 } , rot = { x = 0, y = 118.072, z = 0 } , level = 88 },
	{ config_id = 6024 , gadget_id = 70210102 , pos = { x = 6185.755, y = 215.087, z = 10018.28 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 6025 , gadget_id = 70210102 , pos = { x = 6176.896, y = 213.873, z = 10017.14 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 6026 , gadget_id = 71700288 , pos = { x = 6175.153, y = 215.018, z = 10020.82 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6027 , gadget_id = 73070014 , pos = { x = 6175.012, y = 214.712, z = 10020.94 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6028 , gadget_id = 73070062 , pos = { x = 6198.579, y = 216.079, z = 10020.93 } , rot = { x = 0, y = 316.284, z = 0 } , level = 93 },
	{ config_id = 6029 , gadget_id = 73070062 , pos = { x = 6187.908, y = 216.079, z = 10025.14 } , rot = { x = 0, y = 254.299, z = 0 } , level = 93 },
	{ config_id = 6030 , gadget_id = 73070011 , pos = { x = 6175.17, y = 214.607, z = 10020.76 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 6036 , gadget_id = 42215010 , pos = { x = 6183.741, y = 214, z = 10020.62 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 6001,6012,6014,6015,6017,6018,6024,6025,6026,6027,6028,6029,6030,6036 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
