-- 基础信息
local base_info = {
	group_id = 133605036
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 36002 , monster_id = 20011001 , pos = { x = 2187.244, y = -206.855, z = 8789.541 } , rot = { x = 0, y = 52.01, z = 0 } , level = 88 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 36003 , monster_id = 20011001 , pos = { x = 2187.1, y = -206.73, z = 8794.079 } , rot = { x = 0, y = 106.285, z = 0 } , level = 88 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 36004 , monster_id = 20011101 , pos = { x = 2188.616, y = -207.412, z = 8791.394 } , rot = { x = 0, y = 87.864, z = 0 } , level = 88 , title_id = 1051, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 36002,36003,36004 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
