-- 基础信息
local base_info = {
	group_id = 133604090
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 90002 , monster_id = 23074101 , pos = { x = 2278.75, y = 200.43, z = 9502.305 } , rot = { x = 0, y = 0, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 90003 , monster_id = 23073101 , pos = { x = 2279.795, y = 200.271, z = 9505.366 } , rot = { x = 0, y = 22, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741301 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 90004 , gadget_id = 42308099 , pos = { x = 2274.729, y = 200.137, z = 9548.068 } , rot = { x = 0, y = 0, z = 0 } , level = 87 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 90002,90003 },
		gadgets = { 90004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
