-- 基础信息
local base_info = {
	group_id = 133601029
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 29005 , monster_id = 23085301 , pos = { x = 3100.968, y = 186.737, z = 9754.358 } , rot = { x = 0, y = 140, z = 0 } , level = 91 , title_id = 10539, special_name_id = 10450 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 29006 , gadget_id = 73073038 , pos = { x = 3117.511, y = 186.718, z = 9753.114 } , rot = { x = 0, y = 230, z = 0 } , level = 91 },
	{ config_id = 29007 , gadget_id = 73073039 , pos = { x = 3099.779, y = 186.741, z = 9738.258 } , rot = { x = 0, y = 50, z = 0 } , level = 91 },
	{ config_id = 29010 , gadget_id = 70950164 , pos = { x = 3108.379, y = 186.5, z = 9745.241 } , rot = { x = 0, y = 320, z = 0 } , level = 91 },
	{ config_id = 29012 , gadget_id = 42308099 , pos = { x = 3108.475, y = 186.664, z = 9745.257 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 29005 },
		gadgets = { 29006,29007,29010,29012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
