-- 基础信息
local base_info = {
	group_id = 133601163
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 163052 , monster_id = 22130202 , pos = { x = 1960.313, y = 200.137, z = 9716.929 } , rot = { x = 0, y = 262.447, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 163053 , monster_id = 22130104 , pos = { x = 1956.568, y = 200.137, z = 9716.9 } , rot = { x = 0, y = 318.067, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 163054 , monster_id = 22130103 , pos = { x = 1953.327, y = 200.106, z = 9717.837 } , rot = { x = 0, y = 249.24, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 163055 , monster_id = 22130201 , pos = { x = 1953.072, y = 200.092, z = 9722.781 } , rot = { x = 0, y = 184.3, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 163002 , gadget_id = 70220226 , pos = { x = 1956.602, y = 200.112, z = 9721.008 } , rot = { x = 0, y = 186.497, z = 0 } , level = 92 },
	{ config_id = 163059 , gadget_id = 73073026 , pos = { x = 1949.092, y = 200.21, z = 9727.113 } , rot = { x = 355.614, y = 27.01, z = 358.768 } , level = 89 },
	{ config_id = 163060 , gadget_id = 73073027 , pos = { x = 1949.36, y = 200.067, z = 9717.829 } , rot = { x = 1.187, y = 294.662, z = 359.56 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 163052,163053,163054,163055 },
		gadgets = { 163002,163059,163060 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
