-- 基础信息
local base_info = {
	group_id = 133605014
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 14001 , monster_id = 25010401 , pos = { x = 2214.452, y = 279.093, z = 9228.903 } , rot = { x = 0, y = 272.744, z = 0 } , level = 88 , title_id = 7122, special_name_id = 2700105 },
	{ config_id = 14004 , monster_id = 25010701 , pos = { x = 2209.113, y = 279.862, z = 9230.87 } , rot = { x = 0, y = 263.824, z = 0 } , level = 88 , title_id = 7111, special_name_id = 2700127 },
	{ config_id = 14005 , monster_id = 25010201 , pos = { x = 2207.608, y = 280.07, z = 9231.069 } , rot = { x = 0, y = 93.203, z = 0 } , level = 88 , title_id = 7001, special_name_id = 2700115 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 14001,14004,14005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
