-- 基础信息
local base_info = {
	group_id = 133607226
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 226179 , gadget_id = 73065004 , pos = { x = 1626.9, y = 205.626, z = 9959.979 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226180 , gadget_id = 73065004 , pos = { x = 1624.594, y = 205.56, z = 9960.182 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226181 , gadget_id = 73065004 , pos = { x = 1622.967, y = 207.115, z = 9955.94 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226182 , gadget_id = 73065004 , pos = { x = 1621.994, y = 207.735, z = 9957.521 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226183 , gadget_id = 73065004 , pos = { x = 1623.84, y = 205.215, z = 9960.236 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226198 , gadget_id = 73065004 , pos = { x = 1776.184, y = 257.923, z = 9788.842 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226199 , gadget_id = 73065004 , pos = { x = 1776.458, y = 257.35, z = 9787.502 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226200 , gadget_id = 73065004 , pos = { x = 1768.408, y = 257.3, z = 9798.336 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226205 , gadget_id = 73065004 , pos = { x = 1622.131, y = 208.276, z = 9955.97 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226206 , gadget_id = 73065004 , pos = { x = 1625.805, y = 205.919, z = 9959.694 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226210 , gadget_id = 73065004 , pos = { x = 1780.425, y = 260.024, z = 9792.295 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226211 , gadget_id = 73065004 , pos = { x = 1780.326, y = 259.755, z = 9791.334 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226214 , gadget_id = 73065004 , pos = { x = 1760.092, y = 223.712, z = 9747.588 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226215 , gadget_id = 73065004 , pos = { x = 1764.331, y = 222.045, z = 9758.006 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226217 , gadget_id = 73065004 , pos = { x = 1791.006, y = 233.553, z = 9734.003 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226218 , gadget_id = 73065004 , pos = { x = 1785.169, y = 231.379, z = 9732.888 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226219 , gadget_id = 73065004 , pos = { x = 1750.198, y = 247.281, z = 9734.428 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226220 , gadget_id = 73065004 , pos = { x = 1748.511, y = 247.199, z = 9735.473 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226221 , gadget_id = 73065004 , pos = { x = 1760.188, y = 227.061, z = 9744.948 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226224 , gadget_id = 73065004 , pos = { x = 1610.558, y = 201.561, z = 9964.159 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226225 , gadget_id = 73065004 , pos = { x = 1609.73, y = 201.107, z = 9981.83 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226226 , gadget_id = 73065004 , pos = { x = 1609.373, y = 201.219, z = 9964.48 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226232 , gadget_id = 73065004 , pos = { x = 1767.554, y = 183.399, z = 9729.435 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226233 , gadget_id = 73065004 , pos = { x = 1750.482, y = 183.768, z = 9741.583 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226234 , gadget_id = 73065004 , pos = { x = 1752.286, y = 183.431, z = 9740.573 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226237 , gadget_id = 73065004 , pos = { x = 1611.993, y = 201.063, z = 9965.625 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226244 , gadget_id = 73065004 , pos = { x = 1768.113, y = 236.907, z = 9780.43 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226245 , gadget_id = 73065004 , pos = { x = 1769.078, y = 236.532, z = 9780.885 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226246 , gadget_id = 73065004 , pos = { x = 1772.7, y = 232.739, z = 9776.213 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226247 , gadget_id = 73065004 , pos = { x = 1771.317, y = 236.392, z = 9779.889 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226248 , gadget_id = 73065004 , pos = { x = 1791.317, y = 236.332, z = 9737.206 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226249 , gadget_id = 73065004 , pos = { x = 1760.937, y = 238.997, z = 9748.501 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226250 , gadget_id = 73065004 , pos = { x = 1789.012, y = 242.133, z = 9749.227 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226251 , gadget_id = 73065004 , pos = { x = 1787.525, y = 242.503, z = 9752.106 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226252 , gadget_id = 73065004 , pos = { x = 1788.202, y = 242.99, z = 9751.038 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226253 , gadget_id = 73065004 , pos = { x = 1760.789, y = 239.562, z = 9745.206 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226254 , gadget_id = 73065004 , pos = { x = 1778.945, y = 236.925, z = 9756.508 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226255 , gadget_id = 73065004 , pos = { x = 1761.707, y = 240.128, z = 9735.354 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226258 , gadget_id = 73065004 , pos = { x = 1791.23, y = 235.626, z = 9739.772 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226259 , gadget_id = 73065004 , pos = { x = 1758.564, y = 237.552, z = 9745.497 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226260 , gadget_id = 73065004 , pos = { x = 1789.982, y = 239.431, z = 9746.609 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226261 , gadget_id = 73065004 , pos = { x = 1769.011, y = 231.13, z = 9773.987 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226262 , gadget_id = 73065004 , pos = { x = 1779.606, y = 235.651, z = 9756.022 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226263 , gadget_id = 73065004 , pos = { x = 1773.902, y = 232.266, z = 9776.749 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226264 , gadget_id = 73065004 , pos = { x = 1781.04, y = 236.254, z = 9754.289 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226337 , gadget_id = 73045151 , pos = { x = 1748.007, y = 253.705, z = 9730.382 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226339 , gadget_id = 73045151 , pos = { x = 1755.61, y = 253.09, z = 9728.07 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226347 , gadget_id = 73045226 , pos = { x = 1626.68, y = 204.21, z = 9959.91 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226348 , gadget_id = 73045226 , pos = { x = 1624.401, y = 204.452, z = 9960.14 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226349 , gadget_id = 73045226 , pos = { x = 1622.8, y = 206.22, z = 9955.92 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226350 , gadget_id = 73045226 , pos = { x = 1621.76, y = 206.39, z = 9957.47 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226351 , gadget_id = 73045226 , pos = { x = 1623.698, y = 204.375, z = 9960.205 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226352 , gadget_id = 73045226 , pos = { x = 1619.47, y = 212.95, z = 9944.96 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226367 , gadget_id = 73045226 , pos = { x = 1775.924, y = 256.24, z = 9788.778 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226368 , gadget_id = 73045226 , pos = { x = 1776.179, y = 255.871, z = 9787.438 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226369 , gadget_id = 73045226 , pos = { x = 1768.18, y = 255.92, z = 9798.277 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226374 , gadget_id = 73045226 , pos = { x = 1622.305, y = 206.051, z = 9956.421 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226375 , gadget_id = 73045226 , pos = { x = 1625.99, y = 204.1, z = 9960.02 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226376 , gadget_id = 73045226 , pos = { x = 1620.49, y = 212.68, z = 9944.17 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226380 , gadget_id = 73045226 , pos = { x = 1780.637, y = 257.75, z = 9792.698 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226381 , gadget_id = 73045226 , pos = { x = 1780.459, y = 258.198, z = 9791.626 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226383 , gadget_id = 73065004 , pos = { x = 1620.248, y = 214.894, z = 9943.805 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 226384 , gadget_id = 73065004 , pos = { x = 1619.674, y = 214.201, z = 9944.998 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 226179,226180,226181,226182,226183,226198,226199,226200,226205,226206,226210,226211,226214,226215,226217,226218,226219,226220,226221,226224,226225,226226,226232,226233,226234,226237,226244,226245,226246,226247,226248,226249,226250,226251,226252,226253,226254,226255,226258,226259,226260,226261,226262,226263,226264,226337,226339,226347,226348,226349,226350,226351,226352,226367,226368,226369,226374,226375,226376,226380,226381,226383,226384 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
