-- 基础信息
local base_info = {
	group_id = 133611295
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 295002 , monster_id = 23079301 , pos = { x = 5642.447, y = 202.123, z = 10135.51 } , rot = { x = 0, y = 326.387, z = 0 } , level = 90 , title_id = 7411, special_name_id = 2741901 },
	{ config_id = 295004 , monster_id = 23074102 , pos = { x = 5638.039, y = 202.06, z = 10137.07 } , rot = { x = 0, y = 113.928, z = 0 } , level = 90 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 295005 , monster_id = 23076102 , pos = { x = 5639.851, y = 202.185, z = 10138.43 } , rot = { x = 0, y = 136.849, z = 0 } , level = 90 , title_id = 7411, special_name_id = 2741501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 295007 , gadget_id = 70211012 , pos = { x = 5636.188, y = 202.017, z = 10137.92 } , rot = { x = 4.287, y = 108.141, z = 353.049 } , level = 88 },
	{ config_id = 295012 , gadget_id = 42308099 , pos = { x = 5638.422, y = 201.907, z = 10136.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 295002,295004,295005 },
		gadgets = { 295007,295012 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
