-- 基础信息
local base_info = {
	group_id = 133601024
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 24001 , monster_id = 23079101 , pos = { x = 3164.051, y = 230.6, z = 9439.92 } , rot = { x = 0, y = 336.321, z = 0 } , level = 91 , title_id = 5123, special_name_id = 2900101 },
	{ config_id = 24004 , monster_id = 23071101 , pos = { x = 3165.17, y = 230.611, z = 9443.254 } , rot = { x = 0, y = 182.729, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 24006 , monster_id = 23075101 , pos = { x = 3164.742, y = 233.473, z = 9428.026 } , rot = { x = 0, y = 52.477, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 24007 , monster_id = 23074101 , pos = { x = 3163.852, y = 230.517, z = 9442.808 } , rot = { x = 0, y = 147.353, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 24008 , gadget_id = 42308099 , pos = { x = 3164.859, y = 230.739, z = 9439.65 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 24001,24004,24006,24007 },
		gadgets = { 24008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
