-- 基础信息
local base_info = {
	group_id = 133605138
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 138125 , gadget_id = 73065004 , pos = { x = 2210.324, y = 212.812, z = 9131.284 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138128 , gadget_id = 73065004 , pos = { x = 2295.625, y = 274.754, z = 9102.939 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138129 , gadget_id = 73065004 , pos = { x = 2297.812, y = 275.627, z = 9093.782 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138130 , gadget_id = 73065004 , pos = { x = 2299.447, y = 276.589, z = 9092.376 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138131 , gadget_id = 73065004 , pos = { x = 2299.725, y = 275.868, z = 9091.552 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138132 , gadget_id = 73065004 , pos = { x = 2175.718, y = 204.339, z = 8988.757 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138133 , gadget_id = 73065004 , pos = { x = 2130.111, y = 205.907, z = 9027.465 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138134 , gadget_id = 73065004 , pos = { x = 2174.757, y = 204.012, z = 8978.726 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138135 , gadget_id = 73065004 , pos = { x = 2128.773, y = 206.588, z = 9031.688 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138136 , gadget_id = 73065004 , pos = { x = 2138.537, y = 206.337, z = 9033.291 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138137 , gadget_id = 73065004 , pos = { x = 2134.828, y = 203.323, z = 9015.68 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138138 , gadget_id = 73065004 , pos = { x = 2129.518, y = 206.235, z = 9031.729 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138139 , gadget_id = 73065004 , pos = { x = 2127.359, y = 207.544, z = 9047.464 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138140 , gadget_id = 73065004 , pos = { x = 2170.967, y = 202.696, z = 8976.165 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138141 , gadget_id = 73065004 , pos = { x = 2130.016, y = 207.44, z = 9044.365 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138142 , gadget_id = 73065004 , pos = { x = 2129.8, y = 207.762, z = 9045.335 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138146 , gadget_id = 73065004 , pos = { x = 2173.041, y = 204.162, z = 8977.295 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138147 , gadget_id = 73065004 , pos = { x = 2129.816, y = 209.057, z = 9045.607 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138148 , gadget_id = 73065004 , pos = { x = 2127.552, y = 206.433, z = 9027.344 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138157 , gadget_id = 73065004 , pos = { x = 2249.624, y = 267.007, z = 9139.826 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138158 , gadget_id = 73065004 , pos = { x = 2244.361, y = 267.78, z = 9119.729 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138159 , gadget_id = 73065004 , pos = { x = 2243.021, y = 266.993, z = 9119.865 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138178 , gadget_id = 73065004 , pos = { x = 2215.85, y = 270.075, z = 9199.863 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138181 , gadget_id = 73065004 , pos = { x = 2212.853, y = 268.561, z = 9188.98 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138184 , gadget_id = 73065004 , pos = { x = 2215.672, y = 270.893, z = 9200.802 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138188 , gadget_id = 73065004 , pos = { x = 2092.63, y = 202.3, z = 9199.01 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138189 , gadget_id = 73065004 , pos = { x = 2087.448, y = 201.135, z = 9198.449 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138196 , gadget_id = 73065004 , pos = { x = 2209.119, y = 214.012, z = 9131.66 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138197 , gadget_id = 73065004 , pos = { x = 2211.284, y = 215.123, z = 9129.877 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138202 , gadget_id = 73065004 , pos = { x = 2218.156, y = 218.606, z = 9111.062 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138242 , gadget_id = 73065004 , pos = { x = 2297.498, y = 275.849, z = 9070.652 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138246 , gadget_id = 73065004 , pos = { x = 2070.887, y = 201.224, z = 9179.315 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138247 , gadget_id = 73065004 , pos = { x = 2089.798, y = 201.28, z = 9198.451 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138249 , gadget_id = 73065004 , pos = { x = 2072.08, y = 200, z = 9151.874 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138265 , gadget_id = 73045226 , pos = { x = 2210.1, y = 211.44, z = 9131.23 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138268 , gadget_id = 73045226 , pos = { x = 2295.438, y = 273.577, z = 9102.89 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138269 , gadget_id = 73045226 , pos = { x = 2297.621, y = 274.45, z = 9093.73 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138270 , gadget_id = 73045226 , pos = { x = 2299.199, y = 274.905, z = 9092.276 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138271 , gadget_id = 73045226 , pos = { x = 2299.55, y = 274.69, z = 9091.478 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138272 , gadget_id = 73045226 , pos = { x = 2296.797, y = 275.356, z = 9070.822 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138274 , gadget_id = 73045226 , pos = { x = 2060.987, y = 203.795, z = 9194.989 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138275 , gadget_id = 73045226 , pos = { x = 2175.46, y = 202.777, z = 8988.7 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138276 , gadget_id = 73045226 , pos = { x = 2129.83, y = 204.227, z = 9027.41 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138277 , gadget_id = 73045226 , pos = { x = 2174.484, y = 202.33, z = 8978.665 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138278 , gadget_id = 73045226 , pos = { x = 2128.462, y = 204.914, z = 9031.771 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138279 , gadget_id = 73045226 , pos = { x = 2138.346, y = 205.135, z = 9033.234 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138280 , gadget_id = 73045226 , pos = { x = 2134.547, y = 201.643, z = 9015.614 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138281 , gadget_id = 73045226 , pos = { x = 2129.267, y = 204.784, z = 9031.668 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138282 , gadget_id = 73045226 , pos = { x = 2127.206, y = 206.53, z = 9047.421 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138283 , gadget_id = 73045226 , pos = { x = 2170.7, y = 201.014, z = 8976.09 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138284 , gadget_id = 73045226 , pos = { x = 2129.733, y = 205.76, z = 9044.309 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138285 , gadget_id = 73045226 , pos = { x = 2129.52, y = 206.081, z = 9045.281 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138286 , gadget_id = 73045226 , pos = { x = 2072.068, y = 199.697, z = 9151.563 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138290 , gadget_id = 73045226 , pos = { x = 2173.36, y = 201.314, z = 8977.78 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138291 , gadget_id = 73045226 , pos = { x = 2130.15, y = 206.24, z = 9046.05 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138292 , gadget_id = 73045226 , pos = { x = 2127.9, y = 203.49, z = 9027.82 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138293 , gadget_id = 73045226 , pos = { x = 2071, y = 199.4, z = 9151.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138302 , gadget_id = 73045226 , pos = { x = 2249.43, y = 265.676, z = 9139.775 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138303 , gadget_id = 73045226 , pos = { x = 2244.09, y = 266.099, z = 9119.654 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138304 , gadget_id = 73045226 , pos = { x = 2242.83, y = 265.816, z = 9119.812 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138322 , gadget_id = 73045226 , pos = { x = 2215.661, y = 268.898, z = 9199.814 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138325 , gadget_id = 73045226 , pos = { x = 2212.65, y = 267.386, z = 9188.94 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138331 , gadget_id = 73045226 , pos = { x = 2215.815, y = 269.424, z = 9201.071 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138335 , gadget_id = 73065004 , pos = { x = 2061.279, y = 205.473, z = 9195.053 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 138337 , gadget_id = 73065004 , pos = { x = 2165.393, y = -152.286, z = 9004.316 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138338 , gadget_id = 73065004 , pos = { x = 2148.465, y = -150.508, z = 8998.053 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138339 , gadget_id = 73065004 , pos = { x = 2190.023, y = -147.368, z = 8979.804 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138340 , gadget_id = 73065004 , pos = { x = 2196.341, y = -145.223, z = 8979.492 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138341 , gadget_id = 73065004 , pos = { x = 2191.59, y = -147.557, z = 8974.916 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138342 , gadget_id = 73065004 , pos = { x = 2195.694, y = -147.017, z = 8973.256 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138343 , gadget_id = 73065004 , pos = { x = 2214.762, y = -156.026, z = 8969.968 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138344 , gadget_id = 73065004 , pos = { x = 2227.918, y = -160.319, z = 8969.694 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138345 , gadget_id = 73065004 , pos = { x = 2220.677, y = -159.009, z = 8968.381 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138346 , gadget_id = 73065004 , pos = { x = 2194.83, y = -152.76, z = 8963.878 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138347 , gadget_id = 73065004 , pos = { x = 2221.88, y = -158.218, z = 8966.863 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138348 , gadget_id = 73065004 , pos = { x = 2204.607, y = -155.885, z = 8962.99 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138349 , gadget_id = 73065004 , pos = { x = 2199.946, y = -153.479, z = 8961.346 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138350 , gadget_id = 73065004 , pos = { x = 2223.919, y = -202.77, z = 8968.969 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138351 , gadget_id = 73065004 , pos = { x = 2233.363, y = -202.921, z = 8964.017 } , rot = { x = 0, y = 0, z = 0 } , level = 88 },
	{ config_id = 138352 , gadget_id = 73065004 , pos = { x = 2232.231, y = -197.378, z = 8961.369 } , rot = { x = 0, y = 0, z = 0 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 138125,138128,138129,138130,138131,138132,138133,138134,138135,138136,138137,138138,138139,138140,138141,138142,138146,138147,138148,138157,138158,138159,138178,138181,138184,138188,138189,138196,138197,138202,138242,138246,138247,138249,138265,138268,138269,138270,138271,138272,138274,138275,138276,138277,138278,138279,138280,138281,138282,138283,138284,138285,138286,138290,138291,138292,138293,138302,138303,138304,138322,138325,138331,138335,138337,138338,138339,138340,138341,138342,138343,138344,138345,138346,138347,138348,138349,138350,138351,138352 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
