-- 基础信息
local base_info = {
	group_id = 133601323
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 323001 , monster_id = 25000032 , pos = { x = 1894.427, y = 200.783, z = 9679.406 } , rot = { x = 0, y = 55.019, z = 0 } , level = 89 , title_id = 7005, special_name_id = 2900101 },
	{ config_id = 323004 , monster_id = 25000011 , pos = { x = 1893.187, y = 200.839, z = 9679.532 } , rot = { x = 0, y = 55.916, z = 0 } , level = 89 , title_id = 7005, special_name_id = 2900101 },
	{ config_id = 323005 , monster_id = 25010301 , pos = { x = 1887.93, y = 206.086, z = 9674.534 } , rot = { x = 0, y = 33.972, z = 0 } , level = 89 , title_id = 7121, special_name_id = 2700117 },
	{ config_id = 323006 , monster_id = 25000001 , pos = { x = 1892.911, y = 200.887, z = 9687.916 } , rot = { x = 0, y = 341.026, z = 0 } , level = 89 , title_id = 7005, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 323007 , gadget_id = 73045044 , pos = { x = 1894.415, y = 201.106, z = 9670.013 } , rot = { x = 331.776, y = 135.089, z = 345.147 } , level = 89 },
	{ config_id = 323008 , gadget_id = 73045044 , pos = { x = 1895.474, y = 201.043, z = 9691.614 } , rot = { x = 335.288, y = 169.034, z = 5.092 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 323001,323004,323005,323006 },
		gadgets = { 323007,323008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
