-- 基础信息
local base_info = {
	group_id = 133601280
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 280001 , monster_id = 23079101 , pos = { x = 3095.472, y = 202.942, z = 10086.71 } , rot = { x = 0, y = 83.682, z = 0 } , level = 91 , title_id = 5123, special_name_id = 2900101 },
	{ config_id = 280005 , monster_id = 23077101 , pos = { x = 3096.552, y = 202.942, z = 10085.43 } , rot = { x = 0, y = 44.583, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741501 },
	{ config_id = 280006 , monster_id = 23080302 , pos = { x = 3117.065, y = 200, z = 10086.35 } , rot = { x = 0, y = 315.701, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 280007 , gadget_id = 42308099 , pos = { x = 3100.183, y = 200.085, z = 10090.96 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 280001,280005,280006 },
		gadgets = { 280007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
