-- 基础信息
local base_info = {
	group_id = 133601026
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 26001 , monster_id = 23079301 , pos = { x = 3294.743, y = 200.893, z = 9503.35 } , rot = { x = 0, y = 24.859, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741901 },
	{ config_id = 26005 , monster_id = 23085101 , pos = { x = 3310.743, y = 198.995, z = 9501.957 } , rot = { x = 0, y = 300, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742601 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 26006 , gadget_id = 42308099 , pos = { x = 3317.083, y = 200, z = 9497.828 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 26001,26005 },
		gadgets = { 26006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
