-- 基础信息
local base_info = {
	group_id = 133601158
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 158027 , monster_id = 22130002 , pos = { x = 3530.784, y = 224.264, z = 9794.472 } , rot = { x = 0, y = 323.585, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 158028 , monster_id = 22130101 , pos = { x = 3524.326, y = 225.167, z = 9799.02 } , rot = { x = 0, y = 124.787, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 158029 , monster_id = 22131001 , pos = { x = 3526.254, y = 224.484, z = 9794.378 } , rot = { x = 0, y = 12.877, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408801 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 158010 , gadget_id = 70220226 , pos = { x = 3528.158, y = 224.637, z = 9800.506 } , rot = { x = 0, y = 129, z = 0 } , level = 91 },
	{ config_id = 158032 , gadget_id = 73073027 , pos = { x = 3519.063, y = 225.572, z = 9797.899 } , rot = { x = 350.77, y = 306.866, z = 1.944 } , level = 91 },
	{ config_id = 158033 , gadget_id = 73073026 , pos = { x = 3535.534, y = 224.716, z = 9797.964 } , rot = { x = 3.009, y = 152.003, z = 352.371 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 158027,158028,158029 },
		gadgets = { 158010,158032,158033 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
