-- 基础信息
local base_info = {
	group_id = 133601023
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 23001 , monster_id = 23072101 , pos = { x = 3057.209, y = 206.93, z = 9386.916 } , rot = { x = 0, y = 354.357, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 23004 , monster_id = 23073102 , pos = { x = 3058.244, y = 206.899, z = 9384.535 } , rot = { x = 0, y = 278.182, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 },
	{ config_id = 23005 , monster_id = 23080201 , pos = { x = 3056.835, y = 206.923, z = 9384.785 } , rot = { x = 0, y = 89.861, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742201 },
	{ config_id = 23006 , monster_id = 23080401 , pos = { x = 3056.963, y = 206.946, z = 9387.928 } , rot = { x = 0, y = 90.431, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 23007 , gadget_id = 42308099 , pos = { x = 3057.547, y = 206.915, z = 9386.158 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 23001,23004,23005,23006 },
		gadgets = { 23007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
