-- 基础信息
local base_info = {
	group_id = 133611075
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 75029 , monster_id = 38023005 , pos = { x = 5677.737, y = 264.839, z = 9623.411 } , rot = { x = 0, y = 88.108, z = 0 } , level = 90 },
	{ config_id = 75085 , monster_id = 22040201 , pos = { x = 5681.326, y = 265.352, z = 9621.434 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 4031, special_name_id = 2403101 },
	{ config_id = 75087 , monster_id = 22040201 , pos = { x = 5677.41, y = 264.481, z = 9626.549 } , rot = { x = 0, y = 63.718, z = 0 } , level = 90 , title_id = 4031, special_name_id = 2403101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 75007 , gadget_id = 70211012 , pos = { x = 5689.224, y = 264.446, z = 9630.226 } , rot = { x = 0.39, y = 220.022, z = 358.501 } , level = 88 },
	{ config_id = 75065 , gadget_id = 73070024 , pos = { x = 5661.476, y = 262.025, z = 9643.366 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 75029,75085,75087 },
		gadgets = { 75007,75065 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
