-- 基础信息
local base_info = {
	group_id = 133605015
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 15001 , monster_id = 20010501 , pos = { x = 2876.752, y = 241.215, z = 9120.552 } , rot = { x = 0, y = 97.637, z = 0 } , level = 88 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 15004 , monster_id = 26300101 , pos = { x = 2873.294, y = 241.128, z = 9120.271 } , rot = { x = 0, y = 1.604, z = 0 } , level = 88 , title_id = 8136, special_name_id = 2813601 },
	{ config_id = 15005 , monster_id = 20010501 , pos = { x = 2868.77, y = 240.906, z = 9119.973 } , rot = { x = 0, y = 229.254, z = 0 } , level = 88 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 15006 , monster_id = 20010501 , pos = { x = 2871.938, y = 240.486, z = 9125.638 } , rot = { x = 0, y = 20.276, z = 0 } , level = 88 , title_id = 1003, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 15001,15004,15005,15006 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
