-- 基础信息
local base_info = {
	group_id = 133606063
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 63004 , monster_id = 20010701 , pos = { x = 1685.026, y = 200.96, z = 11185.44 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1032, special_name_id = 2100101 },
	{ config_id = 63005 , monster_id = 20010501 , pos = { x = 1684.872, y = 201.056, z = 11184.21 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1003, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 63004,63005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
