-- 基础信息
local base_info = {
	group_id = 133601242
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 242001 , monster_id = 23080102 , pos = { x = 3078.313, y = 204.2, z = 9754.293 } , rot = { x = 0, y = 50, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 242002 , gadget_id = 42308099 , pos = { x = 3078.692, y = 204.2, z = 9755.476 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 242001 },
		gadgets = { 242002 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
