-- 基础信息
local base_info = {
	group_id = 133605181
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 181001 , monster_id = 20011101 , pos = { x = 2325.602, y = 265.619, z = 9116.245 } , rot = { x = 0, y = 318.981, z = 0 } , level = 88 , title_id = 1051, special_name_id = 2100101 },
	{ config_id = 181002 , monster_id = 20011001 , pos = { x = 2312.246, y = 265.942, z = 9125.296 } , rot = { x = 0, y = 45, z = 0 } , level = 88 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 181003 , monster_id = 20010201 , pos = { x = 2323.614, y = 266.181, z = 9129.438 } , rot = { x = 0, y = 275, z = 0 } , level = 88 , title_id = 1011, special_name_id = 2100101 },
	{ config_id = 181004 , monster_id = 20011001 , pos = { x = 2314.68, y = 265.666, z = 9134.327 } , rot = { x = 0, y = 260.001, z = 0 } , level = 88 , title_id = 1005, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 181001,181002,181003,181004 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
