-- 基础信息
local base_info = {
	group_id = 133608003
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 3001 , monster_id = 26162601 , pos = { x = 1902.614, y = 131.338, z = 10526.28 } , rot = { x = 0, y = 181.563, z = 0 } , level = 93 , title_id = 10528, special_name_id = 10444 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3006 , gadget_id = 70360001 , pos = { x = 1904.669, y = 131.282, z = 10525.59 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 3009 , gadget_id = 70360001 , pos = { x = 1946.479, y = 199.448, z = 10606.66 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 3001 },
		gadgets = { 3006,3009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
