-- 基础信息
local base_info = {
	group_id = 133605030
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 30006 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30008 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30010 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30011 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30012 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30013 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30014 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30015 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30016 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30017 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30018 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30019 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30020 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 30021 , gadget_id = 70294066 , pos = { x = 2235.568, y = 327.73, z = 9132.408 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 30006,30008,30010,30011,30012,30013,30014,30015,30016,30017,30018,30019,30020,30021 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
