-- 基础信息
local base_info = {
	group_id = 133606071
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 71001 , monster_id = 21010101 , pos = { x = 2083.682, y = 289.88, z = 10856.96 } , rot = { x = 0, y = 0.737, z = 0 } , level = 90 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 71004 , monster_id = 20011101 , pos = { x = 2085.51, y = 290.195, z = 10857.88 } , rot = { x = 0, y = 348.304, z = 0 } , level = 90 , title_id = 1051, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 71001,71004 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
