-- 基础信息
local base_info = {
	group_id = 133611377
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 377001 , monster_id = 20080501 , pos = { x = 5789.068, y = 201.395, z = 9549.508 } , rot = { x = 0, y = 85.8, z = 0 } , level = 90 , title_id = 2233, special_name_id = 2223701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 377005 , gadget_id = 70211012 , pos = { x = 5786.884, y = 201.372, z = 9554.151 } , rot = { x = 0, y = 125.77, z = 0 } , level = 88 },
	{ config_id = 377006 , gadget_id = 70220045 , pos = { x = 5795.168, y = 200, z = 9558.808 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 377007 , gadget_id = 70220045 , pos = { x = 5801.347, y = 200, z = 9548.038 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 377008 , gadget_id = 70220045 , pos = { x = 5794.71, y = 200, z = 9563.828 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 377001 },
		gadgets = { 377005,377006,377007,377008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
