-- 基础信息
local base_info = {
	group_id = 133601028
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 28004 , monster_id = 23080302 , pos = { x = 3265.835, y = 237.69, z = 9584.07 } , rot = { x = 0, y = 180, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 },
	{ config_id = 28005 , monster_id = 23080302 , pos = { x = 3260.513, y = 237.69, z = 9584.07 } , rot = { x = 0, y = 180, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742301 },
	{ config_id = 28006 , monster_id = 23079101 , pos = { x = 3263.826, y = 237.148, z = 9567.893 } , rot = { x = 0, y = 204.602, z = 0 } , level = 91 , title_id = 5123, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 28007 , gadget_id = 42308099 , pos = { x = 3263.081, y = 237.776, z = 9582.797 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 28004,28005,28006 },
		gadgets = { 28007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
