-- 基础信息
local base_info = {
	group_id = 133602025
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 25005 , monster_id = 23085201 , pos = { x = 3208.466, y = 201.175, z = 9256.679 } , rot = { x = 0, y = 116.569, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742701 },
	{ config_id = 25006 , monster_id = 23085201 , pos = { x = 3229.618, y = 200.596, z = 9243.625 } , rot = { x = 0, y = 201.646, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742701 },
	{ config_id = 25008 , monster_id = 20011001 , pos = { x = 3224.763, y = 200, z = 9236.964 } , rot = { x = 0, y = 57.798, z = 0 } , level = 91 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 25009 , monster_id = 20011001 , pos = { x = 3235.507, y = 200.402, z = 9240.615 } , rot = { x = 0, y = 274.211, z = 0 } , level = 91 , title_id = 1005, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 25010 , gadget_id = 42308099 , pos = { x = 3219.988, y = 200.392, z = 9246.075 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 25005,25006,25008,25009 },
		gadgets = { 25010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
