-- 基础信息
local base_info = {
	group_id = 133601165
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 165003 , monster_id = 22130202 , pos = { x = 2012.864, y = 200.218, z = 10894.5 } , rot = { x = 0, y = 38.222, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 165004 , monster_id = 22130101 , pos = { x = 2008.315, y = 200.201, z = 10893.87 } , rot = { x = 0, y = 114.821, z = 0 } , level = 90 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 165006 , monster_id = 22040201 , pos = { x = 2011.118, y = 200.189, z = 10896.56 } , rot = { x = 0, y = 77.768, z = 0 } , level = 90 , title_id = 4031, special_name_id = 2403101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 165002 , gadget_id = 70220226 , pos = { x = 2014.507, y = 200.44, z = 10897.52 } , rot = { x = 0, y = 197.869, z = 0 } , level = 90 },
	{ config_id = 165014 , gadget_id = 73073027 , pos = { x = 2008.272, y = 200.172, z = 10894.45 } , rot = { x = 1.293, y = 291.163, z = 356.665 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 165003,165004,165006 },
		gadgets = { 165002,165014 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
