-- 基础信息
local base_info = {
	group_id = 133610024
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 24002 , monster_id = 22130101 , pos = { x = 6365.506, y = 252.259, z = 10136.29 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 24004 , monster_id = 22130002 , pos = { x = 6374.088, y = 252.59, z = 10136.94 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 24005 , monster_id = 22131001 , pos = { x = 6369.525, y = 255.939, z = 10145.81 } , rot = { x = 0, y = 180.012, z = 0 } , level = 93 , title_id = 4087, special_name_id = 2408801 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 24007 , gadget_id = 70211022 , pos = { x = 6380.649, y = 256.292, z = 10145.7 } , rot = { x = 0, y = 295.804, z = 0 } , level = 88 },
	{ config_id = 24035 , gadget_id = 73070063 , pos = { x = 6352.928, y = 242.818, z = 10104.05 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 24036 , gadget_id = 73070063 , pos = { x = 6360.512, y = 247.32, z = 10121 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 24044 , gadget_id = 73070031 , pos = { x = 6348.772, y = 249.04, z = 10133.77 } , rot = { x = 0, y = 0, z = 331.55 } , level = 93 },
	{ config_id = 24045 , gadget_id = 73070024 , pos = { x = 6363.726, y = 253.499, z = 10141.15 } , rot = { x = 0, y = 297.052, z = 0 } , level = 75 },
	{ config_id = 24046 , gadget_id = 73070063 , pos = { x = 6374.095, y = 256.064, z = 10185.1 } , rot = { x = 0, y = 0, z = 0 } , level = 75 },
	{ config_id = 24047 , gadget_id = 73074062 , pos = { x = 6378.101, y = 255.017, z = 10140.14 } , rot = { x = 0, y = 0, z = 0 } , level = 75 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 24002,24004,24005 },
		gadgets = { 24007,24035,24036,24044,24045,24046,24047 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
