-- 基础信息
local base_info = {
	group_id = 133610074
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 74003 , monster_id = 22140101 , pos = { x = 6334.423, y = 200.782, z = 10270.83 } , rot = { x = 0, y = 148.357, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 74004 , monster_id = 22140101 , pos = { x = 6328.145, y = 201.548, z = 10266.74 } , rot = { x = 0, y = 148.773, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 74006 , monster_id = 22140101 , pos = { x = 6331.457, y = 201.7, z = 10269.83 } , rot = { x = 0, y = 158.329, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 74015 , monster_id = 22140101 , pos = { x = 6320.694, y = 201.337, z = 10266.98 } , rot = { x = 0, y = 0, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 74001 , gadget_id = 70211012 , pos = { x = 6314.689, y = 201.496, z = 10274.43 } , rot = { x = 358.799, y = 112.341, z = 0.811 } , level = 88 },
	{ config_id = 74007 , gadget_id = 42215010 , pos = { x = 6333.637, y = 202.263, z = 10264.65 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 74003,74004,74006,74015 },
		gadgets = { 74001,74007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
