-- 基础信息
local base_info = {
	group_id = 133601003
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 3001 , monster_id = 23085102 , pos = { x = 3185.191, y = 204.7, z = 9653.053 } , rot = { x = 0, y = 140, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742601 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 3003 , gadget_id = 42308099 , pos = { x = 3186.178, y = 204.7, z = 9652.309 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 3001 },
		gadgets = { 3003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
