-- 基础信息
local base_info = {
	group_id = 133611175
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 175001 , monster_id = 35550506 , pos = { x = 5816.483, y = 263.74, z = 9792.704 } , rot = { x = 0, y = 50.18, z = 0 } , level = 90 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 175008 , monster_id = 35550311 , pos = { x = 5828.878, y = 263.221, z = 9800.405 } , rot = { x = 0, y = 160.969, z = 0 } , level = 90 , title_id = 7359, special_name_id = 2900101 },
	{ config_id = 175028 , monster_id = 35550311 , pos = { x = 5815.945, y = 263.545, z = 9804.409 } , rot = { x = 0, y = 247.806, z = 0 } , level = 90 , title_id = 7359, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 175004 , gadget_id = 73070063 , pos = { x = 5825.229, y = 263.69, z = 9819.095 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175005 , gadget_id = 73070063 , pos = { x = 5812.562, y = 265.263, z = 9800.127 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175006 , gadget_id = 73070063 , pos = { x = 5831.498, y = 264.282, z = 9792.561 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175009 , gadget_id = 73070011 , pos = { x = 5830.464, y = 263.167, z = 9792.384 } , rot = { x = 0, y = 320.823, z = 0 } , level = 93 },
	{ config_id = 175010 , gadget_id = 70211112 , pos = { x = 5815.417, y = 264.479, z = 9794.698 } , rot = { x = 0, y = 67.682, z = 0 } , level = 88 },
	{ config_id = 175018 , gadget_id = 73070063 , pos = { x = 5819.151, y = 264.96, z = 9789.604 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175023 , gadget_id = 73070014 , pos = { x = 5825.393, y = 263.107, z = 9819.13 } , rot = { x = 0, y = 82.465, z = 0 } , level = 93 },
	{ config_id = 175024 , gadget_id = 73070014 , pos = { x = 5812.577, y = 264.963, z = 9800.119 } , rot = { x = 0, y = 144.538, z = 0 } , level = 93 },
	{ config_id = 175025 , gadget_id = 73070014 , pos = { x = 5830.671, y = 263.804, z = 9810.341 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175026 , gadget_id = 73070014 , pos = { x = 5831.472, y = 263.497, z = 9792.536 } , rot = { x = 0, y = 304.026, z = 0 } , level = 93 },
	{ config_id = 175027 , gadget_id = 70211002 , pos = { x = 5830.309, y = 263.487, z = 9810.368 } , rot = { x = 0, y = 203.369, z = 0 } , level = 88 },
	{ config_id = 175030 , gadget_id = 73074075 , pos = { x = 5821.75, y = 275.059, z = 9801.604 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175036 , gadget_id = 73070024 , pos = { x = 5779.58, y = 256.697, z = 9854.007 } , rot = { x = 0, y = 184.195, z = 0 } , level = 93 },
	{ config_id = 175044 , gadget_id = 73070011 , pos = { x = 5831.068, y = 263.582, z = 9802.682 } , rot = { x = 0, y = 110.494, z = 0 } , level = 93 },
	{ config_id = 175058 , gadget_id = 73070031 , pos = { x = 5833.814, y = 263.873, z = 9802.595 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175059 , gadget_id = 73116011 , pos = { x = 5832.944, y = 264.036, z = 9802.507 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 175061 , gadget_id = 73036129 , pos = { x = 5802.923, y = 262.331, z = 9834.62 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 175001,175008,175028 },
		gadgets = { 175004,175005,175006,175009,175010,175018,175023,175024,175025,175026,175027,175030,175036,175044,175058,175059,175061 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
