-- 基础信息
local base_info = {
	group_id = 133607081
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 81017 , monster_id = 25000011 , pos = { x = 2494.691, y = 293.792, z = 8955.387 } , rot = { x = 0, y = 104.254, z = 0 } , level = 88 , title_id = 7005, special_name_id = 2900101 },
	{ config_id = 81018 , monster_id = 25000031 , pos = { x = 2485.286, y = 292.467, z = 8954.379 } , rot = { x = 0, y = 4.721, z = 0 } , level = 88 , title_id = 7005, special_name_id = 2900101 },
	{ config_id = 81019 , monster_id = 25000001 , pos = { x = 2486.269, y = 291.303, z = 8956.255 } , rot = { x = 0, y = 303.282, z = 0 } , level = 88 , title_id = 7005, special_name_id = 2900101 },
	{ config_id = 81020 , monster_id = 25000021 , pos = { x = 2492.706, y = 293.049, z = 8955.738 } , rot = { x = 0, y = 80.265, z = 0 } , level = 88 , title_id = 7005, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 81017,81018,81019,81020 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
