-- 基础信息
local base_info = {
	group_id = 133602007
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 7001 , monster_id = 23080201 , pos = { x = 3559.932, y = 200.42, z = 9246.375 } , rot = { x = 0, y = 0, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742201 },
	{ config_id = 7004 , monster_id = 23080102 , pos = { x = 3564.285, y = 200.358, z = 9252.349 } , rot = { x = 0, y = 313.126, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 },
	{ config_id = 7006 , monster_id = 23085201 , pos = { x = 3550.413, y = 200.179, z = 9248.659 } , rot = { x = 0, y = 0, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 7007 , gadget_id = 42308099 , pos = { x = 3555.562, y = 200.299, z = 9247.913 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 7001,7004,7006 },
		gadgets = { 7007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
