-- 基础信息
local base_info = {
	group_id = 133604023
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 23001 , monster_id = 25010201 , pos = { x = 2195.314, y = 235.724, z = 9346.84 } , rot = { x = 0, y = 308.213, z = 0 } , level = 88 , title_id = 7001, special_name_id = 2700109 },
	{ config_id = 23002 , monster_id = 25010701 , pos = { x = 2210.977, y = 240.827, z = 9348.974 } , rot = { x = 0, y = 245.028, z = 0 } , level = 88 , title_id = 7111, special_name_id = 2700126 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 23001,23002 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
