-- 基础信息
local base_info = {
	group_id = 133601237
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 237001 , monster_id = 23077102 , pos = { x = 3182.609, y = 201.277, z = 9634.669 } , rot = { x = 0, y = 227.106, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741501 },
	{ config_id = 237002 , monster_id = 23078102 , pos = { x = 3180.778, y = 204.7, z = 9627.696 } , rot = { x = 0, y = 16.318, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741601 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 237003 , gadget_id = 42308099 , pos = { x = 3178.116, y = 204.956, z = 9630.07 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 237001,237002 },
		gadgets = { 237003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
