-- 基础信息
local base_info = {
	group_id = 133606074
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 74004 , monster_id = 20011001 , pos = { x = 1677.275, y = 200.013, z = 10483.76 } , rot = { x = 0, y = 160.172, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 74005 , monster_id = 20011001 , pos = { x = 1674.093, y = 200, z = 10478.67 } , rot = { x = 0, y = 245.485, z = 0 } , level = 90 , title_id = 1005, special_name_id = 2100101 },
	{ config_id = 74008 , monster_id = 20011101 , pos = { x = 1672.631, y = 200, z = 10481.61 } , rot = { x = 0, y = 98.96, z = 0 } , level = 90 , title_id = 1051, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 74004,74005,74008 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
