-- 基础信息
local base_info = {
	group_id = 133606186
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 186001 , gadget_id = 73065003 , pos = { x = 1888.601, y = 145.867, z = 10535.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186002 , gadget_id = 73065003 , pos = { x = 1885.156, y = 133.164, z = 10520.84 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186003 , gadget_id = 73065003 , pos = { x = 1926.757, y = 143.935, z = 10513.45 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186004 , gadget_id = 73065003 , pos = { x = 1926.476, y = 142.748, z = 10511.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186005 , gadget_id = 73065003 , pos = { x = 1923.653, y = 138.221, z = 10528.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186006 , gadget_id = 73065003 , pos = { x = 1892.732, y = 145.142, z = 10542.28 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186007 , gadget_id = 73065003 , pos = { x = 1931.286, y = 163.559, z = 10533.51 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186008 , gadget_id = 73065003 , pos = { x = 1930.579, y = 170.866, z = 10546.76 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186009 , gadget_id = 73065003 , pos = { x = 1901.224, y = 171.102, z = 10556.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186010 , gadget_id = 73065003 , pos = { x = 1924.964, y = 144.075, z = 10517.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186011 , gadget_id = 73065003 , pos = { x = 1913.286, y = 133.438, z = 10502.28 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186012 , gadget_id = 73065003 , pos = { x = 1877.415, y = 134.825, z = 10497.9 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186013 , gadget_id = 73065003 , pos = { x = 1882.627, y = 132.434, z = 10521.58 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186014 , gadget_id = 73065003 , pos = { x = 1873.282, y = 138.6, z = 10512 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186015 , gadget_id = 73065003 , pos = { x = 1883.475, y = 145.599, z = 10536.78 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186016 , gadget_id = 73065003 , pos = { x = 1926.568, y = 170.308, z = 10551.61 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186017 , gadget_id = 73065003 , pos = { x = 1928.207, y = 163.67, z = 10537.27 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186018 , gadget_id = 73065003 , pos = { x = 1884.63, y = 135.893, z = 10534.71 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186019 , gadget_id = 73065003 , pos = { x = 1888.926, y = 145.545, z = 10538.44 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186020 , gadget_id = 73065003 , pos = { x = 1883.926, y = 144.18, z = 10532.94 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186021 , gadget_id = 73065003 , pos = { x = 1927.959, y = 142.822, z = 10535.34 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186022 , gadget_id = 73065003 , pos = { x = 1888.769, y = 154.475, z = 10545.21 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186023 , gadget_id = 73065003 , pos = { x = 1928.387, y = 157.329, z = 10551.62 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186024 , gadget_id = 73065003 , pos = { x = 1885.22, y = 133.63, z = 10527.56 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186025 , gadget_id = 73065003 , pos = { x = 1930.593, y = 145.15, z = 10517.77 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186026 , gadget_id = 73065003 , pos = { x = 1877.202, y = 143.927, z = 10532.41 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186027 , gadget_id = 73065003 , pos = { x = 1892.88, y = 150.824, z = 10550.53 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186028 , gadget_id = 73065003 , pos = { x = 1924.271, y = 141.534, z = 10511.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186029 , gadget_id = 73065003 , pos = { x = 1929.731, y = 170.301, z = 10546.54 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186031 , gadget_id = 73065003 , pos = { x = 1928.648, y = 170.909, z = 10556.02 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186032 , gadget_id = 73065003 , pos = { x = 1880.559, y = 139.473, z = 10521.98 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186033 , gadget_id = 73065003 , pos = { x = 1913.694, y = 132.4, z = 10499.07 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186034 , gadget_id = 73065003 , pos = { x = 1930.05, y = 162.506, z = 10535.9 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186035 , gadget_id = 73065003 , pos = { x = 1881.741, y = 157.388, z = 10512.53 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186036 , gadget_id = 73065003 , pos = { x = 1925.013, y = 138.337, z = 10528.08 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186037 , gadget_id = 73065003 , pos = { x = 1885.337, y = 131.286, z = 10519.82 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186038 , gadget_id = 73065003 , pos = { x = 1900.999, y = 171.04, z = 10560.04 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186039 , gadget_id = 73065003 , pos = { x = 1929.778, y = 161, z = 10544.29 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186040 , gadget_id = 73065003 , pos = { x = 1931.79, y = 170.191, z = 10547.93 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186041 , gadget_id = 73065003 , pos = { x = 1928.667, y = 155.629, z = 10557.23 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186042 , gadget_id = 73065003 , pos = { x = 1930.899, y = 163.584, z = 10530.61 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186043 , gadget_id = 73065003 , pos = { x = 1931.401, y = 164.177, z = 10541.86 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186044 , gadget_id = 73065003 , pos = { x = 1879.229, y = 160.118, z = 10517.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186045 , gadget_id = 73065003 , pos = { x = 1878.54, y = 161.75, z = 10521.83 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186046 , gadget_id = 73065003 , pos = { x = 1903.073, y = 144.95, z = 10549.09 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186047 , gadget_id = 73065003 , pos = { x = 1929.107, y = 144.49, z = 10524.75 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186048 , gadget_id = 73065003 , pos = { x = 1927.894, y = 143.71, z = 10516.93 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186049 , gadget_id = 73065003 , pos = { x = 1904.766, y = 169.129, z = 10567.79 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186050 , gadget_id = 73065003 , pos = { x = 1900.571, y = 157.996, z = 10566.2 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186051 , gadget_id = 73065003 , pos = { x = 1916.762, y = 132.441, z = 10505.01 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186052 , gadget_id = 73065003 , pos = { x = 1874.526, y = 138.143, z = 10508.92 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186053 , gadget_id = 73065003 , pos = { x = 1913.681, y = 134.293, z = 10538.13 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186054 , gadget_id = 73065003 , pos = { x = 1877.056, y = 135.942, z = 10502.95 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186055 , gadget_id = 73065003 , pos = { x = 1876.72, y = 134.856, z = 10498.22 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186056 , gadget_id = 73065003 , pos = { x = 1925.808, y = 140.778, z = 10538.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186057 , gadget_id = 73065003 , pos = { x = 1888.321, y = 145.986, z = 10539.48 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186058 , gadget_id = 73065003 , pos = { x = 1891.304, y = 150.1, z = 10546.42 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186059 , gadget_id = 73065003 , pos = { x = 1927.374, y = 143.214, z = 10513.52 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186060 , gadget_id = 73065003 , pos = { x = 1884.8, y = 144.826, z = 10535.35 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186061 , gadget_id = 73065003 , pos = { x = 1893.187, y = 144.644, z = 10543.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186062 , gadget_id = 73065003 , pos = { x = 1880.043, y = 140.302, z = 10523.04 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186063 , gadget_id = 73065003 , pos = { x = 1930.295, y = 170.667, z = 10544.21 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186064 , gadget_id = 73065003 , pos = { x = 1881.761, y = 144.499, z = 10533.84 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186065 , gadget_id = 73065003 , pos = { x = 1916.49, y = 132.57, z = 10501.04 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186066 , gadget_id = 73065003 , pos = { x = 1924.946, y = 151.784, z = 10561.2 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186067 , gadget_id = 73065003 , pos = { x = 1882.108, y = 156.77, z = 10508.98 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186068 , gadget_id = 73065003 , pos = { x = 1926.048, y = 141.799, z = 10512.92 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186069 , gadget_id = 73065003 , pos = { x = 1924.433, y = 140.946, z = 10507.23 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186070 , gadget_id = 73065003 , pos = { x = 1929.735, y = 158.716, z = 10549.34 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186071 , gadget_id = 73065003 , pos = { x = 1883.02, y = 132.873, z = 10523.6 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186072 , gadget_id = 73065003 , pos = { x = 1903.829, y = 169.366, z = 10564.9 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186073 , gadget_id = 73065003 , pos = { x = 1898.888, y = 171.294, z = 10555.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186075 , gadget_id = 73065003 , pos = { x = 1929.372, y = 170.307, z = 10552.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186076 , gadget_id = 73065003 , pos = { x = 1923.58, y = 138, z = 10532.6 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186077 , gadget_id = 73065003 , pos = { x = 1931.564, y = 163.746, z = 10534.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186078 , gadget_id = 73065003 , pos = { x = 1930.577, y = 163.15, z = 10538.48 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186079 , gadget_id = 73065003 , pos = { x = 1914.596, y = 132.233, z = 10502.08 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186080 , gadget_id = 73065003 , pos = { x = 1930.179, y = 170.453, z = 10542.42 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186081 , gadget_id = 73065003 , pos = { x = 1898.725, y = 171.114, z = 10553.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186082 , gadget_id = 73065003 , pos = { x = 1901.033, y = 171.147, z = 10562.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186083 , gadget_id = 73065003 , pos = { x = 1930.931, y = 170.25, z = 10550.9 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186085 , gadget_id = 73065003 , pos = { x = 1930.076, y = 160.648, z = 10540.42 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186086 , gadget_id = 73065003 , pos = { x = 1880.214, y = 160.943, z = 10522.73 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186087 , gadget_id = 73065003 , pos = { x = 1931.304, y = 145.114, z = 10521.77 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186088 , gadget_id = 73065003 , pos = { x = 1907.401, y = 144.172, z = 10552.61 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186089 , gadget_id = 73065003 , pos = { x = 1899.168, y = 159.163, z = 10566.29 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186090 , gadget_id = 73065003 , pos = { x = 1903.609, y = 154.991, z = 10566.83 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186091 , gadget_id = 73065003 , pos = { x = 1889.528, y = 152.68, z = 10548.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186092 , gadget_id = 73065003 , pos = { x = 1889.364, y = 153.802, z = 10546.88 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186093 , gadget_id = 73065003 , pos = { x = 1884.53, y = 131.976, z = 10522.76 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186094 , gadget_id = 73065003 , pos = { x = 1883.311, y = 131.778, z = 10519.18 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186095 , gadget_id = 73065003 , pos = { x = 1881.531, y = 133.234, z = 10498.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186096 , gadget_id = 73065003 , pos = { x = 1881.196, y = 133.84, z = 10500.19 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186097 , gadget_id = 73065003 , pos = { x = 1876.177, y = 137.737, z = 10513.65 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186098 , gadget_id = 73065003 , pos = { x = 1875.033, y = 136.75, z = 10503.34 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186099 , gadget_id = 73065003 , pos = { x = 1915.403, y = 134.54, z = 10537.92 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186100 , gadget_id = 73065003 , pos = { x = 1914.955, y = 133.886, z = 10536.17 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186101 , gadget_id = 73065003 , pos = { x = 1899.066, y = 171.647, z = 10558.97 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186103 , gadget_id = 73065003 , pos = { x = 1875.062, y = 135.54, z = 10499.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 186104 , gadget_id = 73065003 , pos = { x = 1886.464, y = 135.426, z = 10534.88 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 186001,186002,186003,186004,186005,186006,186007,186008,186009,186010,186011,186012,186013,186014,186015,186016,186017,186018,186019,186020,186021,186022,186023,186024,186025,186026,186027,186028,186029,186031,186032,186033,186034,186035,186036,186037,186038,186039,186040,186041,186042,186043,186044,186045,186046,186047,186048,186049,186050,186051,186052,186053,186054,186055,186056,186057,186058,186059,186060,186061,186062,186063,186064,186065,186066,186067,186068,186069,186070,186071,186072,186073,186075,186076,186077,186078,186079,186080,186081,186082,186083,186085,186086,186087,186088,186089,186090,186091,186092,186093,186094,186095,186096,186097,186098,186099,186100,186101,186103,186104 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
