-- 基础信息
local base_info = {
	group_id = 133605125
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 125001 , monster_id = 23071101 , pos = { x = 2931.629, y = 204.38, z = 9252.597 } , rot = { x = 0, y = 260.882, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 125002 , monster_id = 23070101 , pos = { x = 2936.22, y = 205.669, z = 9246.699 } , rot = { x = 0, y = 347.408, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 125003 , monster_id = 23074101 , pos = { x = 2935.115, y = 204.38, z = 9258.007 } , rot = { x = 0, y = 175.663, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 125004 , monster_id = 23074101 , pos = { x = 2936.665, y = 204.38, z = 9257.034 } , rot = { x = 0, y = 281.811, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 125007 , gadget_id = 42308099 , pos = { x = 2935.033, y = 204.533, z = 9253.209 } , rot = { x = 0, y = 0, z = 0 } , level = 87 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 125001,125002,125003,125004 },
		gadgets = { 125007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
