-- 基础信息
local base_info = {
	group_id = 133606051
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 51001 , monster_id = 20010501 , pos = { x = 1628.764, y = 200.871, z = 10995.49 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 51002 , monster_id = 20010501 , pos = { x = 1638.803, y = 202.463, z = 10996.22 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 51003 , monster_id = 20010601 , pos = { x = 1632.7, y = 200.826, z = 10989.19 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1031, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 51001,51002,51003 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
