-- 基础信息
local base_info = {
	group_id = 133611380
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 380001 , monster_id = 23070101 , pos = { x = 6310.858, y = 203.282, z = 9519.661 } , rot = { x = 0, y = 193.695, z = 0 } , level = 93 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 380002 , monster_id = 23070101 , pos = { x = 6308.783, y = 203.317, z = 9520.108 } , rot = { x = 0, y = 193.19, z = 0 } , level = 93 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 380003 , monster_id = 23070101 , pos = { x = 6306.726, y = 203.317, z = 9520.674 } , rot = { x = 0, y = 186.108, z = 0 } , level = 93 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 380004 , monster_id = 23079101 , pos = { x = 6307.748, y = 204.259, z = 9515.523 } , rot = { x = 0, y = 18.028, z = 0 } , level = 93 , title_id = 5123, special_name_id = 2900101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 380005 , gadget_id = 70211012 , pos = { x = 6306.698, y = 204.326, z = 9511.449 } , rot = { x = 0, y = 10.618, z = 0 } , level = 88 },
	{ config_id = 380019 , gadget_id = 73073039 , pos = { x = 6299.704, y = 204.351, z = 9536.776 } , rot = { x = 0, y = 192.875, z = 0 } , level = 93 },
	{ config_id = 380020 , gadget_id = 73073038 , pos = { x = 6305.436, y = 204.343, z = 9535.8 } , rot = { x = 0, y = 192.372, z = 0 } , level = 93 },
	{ config_id = 380021 , gadget_id = 42308099 , pos = { x = 6309.592, y = 203.304, z = 9524.661 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 380023 , gadget_id = 70211001 , pos = { x = 6316.188, y = 204.2, z = 9498.961 } , rot = { x = 0, y = 299.543, z = 0 } , level = 88 },
	{ config_id = 380039 , gadget_id = 73073033 , pos = { x = 6316.339, y = 204.174, z = 9537.868 } , rot = { x = 355.009, y = 129.582, z = 346.393 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 380001,380002,380003,380004 },
		gadgets = { 380005,380019,380020,380021,380023,380039 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
