-- 基础信息
local base_info = {
	group_id = 133601239
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 239001 , monster_id = 23075101 , pos = { x = 3112.804, y = 204.2, z = 9716.445 } , rot = { x = 0, y = 132.568, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 239002 , monster_id = 23076102 , pos = { x = 3112.834, y = 204.2, z = 9714.64 } , rot = { x = 0, y = 179.235, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 239003 , gadget_id = 42308099 , pos = { x = 3114.875, y = 204.19, z = 9716.069 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 239001,239002 },
		gadgets = { 239003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
