-- 基础信息
local base_info = {
	group_id = 133601172
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 172001 , monster_id = 22130002 , pos = { x = 3210.411, y = 205.159, z = 9321.275 } , rot = { x = 0, y = 201.65, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 172006 , monster_id = 22130101 , pos = { x = 3208.663, y = 205.239, z = 9320.782 } , rot = { x = 0, y = 150.198, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 172007 , monster_id = 22130201 , pos = { x = 3209.344, y = 205.563, z = 9317.44 } , rot = { x = 0, y = 16.387, z = 0 } , level = 91 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 172001,172006,172007 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
