-- 基础信息
local base_info = {
	group_id = 133611382
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 382001 , monster_id = 20080701 , pos = { x = 5730.212, y = 200.527, z = 9350.295 } , rot = { x = 0, y = 96.416, z = 0 } , level = 88 , title_id = 2233, special_name_id = 2223901 },
	{ config_id = 382004 , monster_id = 20011501 , pos = { x = 5729.463, y = 200.691, z = 9345.897 } , rot = { x = 0, y = 60.901, z = 0 } , level = 88 , title_id = 1071, special_name_id = 2100101 },
	{ config_id = 382005 , monster_id = 20011401 , pos = { x = 5734.002, y = 200.695, z = 9344.48 } , rot = { x = 0, y = 18.394, z = 0 } , level = 88 , title_id = 1007, special_name_id = 2100101 },
	{ config_id = 382006 , monster_id = 20011401 , pos = { x = 5727.021, y = 200.798, z = 9352.438 } , rot = { x = 0, y = 103.4, z = 0 } , level = 88 , title_id = 1007, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 382002 , gadget_id = 70211012 , pos = { x = 5728.923, y = 200.468, z = 9336.609 } , rot = { x = 2.706, y = 5.608, z = 1.332 } , level = 88 },
	{ config_id = 382008 , gadget_id = 70211001 , pos = { x = 5727.284, y = 200.515, z = 9336.798 } , rot = { x = 359.918, y = 17.819, z = 357.613 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 382001,382004,382005,382006 },
		gadgets = { 382002,382008 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
