-- 基础信息
local base_info = {
	group_id = 133606027
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 27001 , monster_id = 20010701 , pos = { x = 1721.633, y = 199.719, z = 11005.55 } , rot = { x = 0, y = 166.99, z = 0 } , level = 90 , title_id = 1032, special_name_id = 2100101 },
	{ config_id = 27004 , monster_id = 20010501 , pos = { x = 1725.406, y = 199.719, z = 11009.39 } , rot = { x = 0, y = 166.99, z = 0 } , level = 90 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 27005 , monster_id = 20010501 , pos = { x = 1724.677, y = 199.719, z = 11004.62 } , rot = { x = 0, y = 0, z = 0 } , level = 90 , title_id = 1003, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 27001,27004,27005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
