-- 基础信息
local base_info = {
	group_id = 133604075
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 75156 , gadget_id = 73065004 , pos = { x = 2301.589, y = 204.182, z = 9442.039 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75157 , gadget_id = 73065004 , pos = { x = 2300.149, y = 202.039, z = 9452.208 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75168 , gadget_id = 73065004 , pos = { x = 2300.599, y = 204.809, z = 9440.648 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75171 , gadget_id = 73065004 , pos = { x = 2249.071, y = 270.553, z = 9223.74 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75172 , gadget_id = 73065004 , pos = { x = 2249.501, y = 270.736, z = 9224.297 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75173 , gadget_id = 73065004 , pos = { x = 2240.969, y = 262.324, z = 9244.646 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75174 , gadget_id = 73065004 , pos = { x = 2239.9, y = 264.517, z = 9240.316 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75175 , gadget_id = 73065004 , pos = { x = 2240.912, y = 263.941, z = 9241.806 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75176 , gadget_id = 73065004 , pos = { x = 2246.116, y = 267.103, z = 9234.701 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75177 , gadget_id = 73065004 , pos = { x = 2240.373, y = 265.592, z = 9240.119 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75178 , gadget_id = 73065004 , pos = { x = 2237.004, y = 266.908, z = 9235.189 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75180 , gadget_id = 73065004 , pos = { x = 2242.379, y = 269.484, z = 9225.504 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75181 , gadget_id = 73065004 , pos = { x = 2235.102, y = 263.114, z = 9243.65 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75189 , gadget_id = 73065004 , pos = { x = 2139.154, y = 224.146, z = 9375.905 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75192 , gadget_id = 73065004 , pos = { x = 2141.369, y = 226.095, z = 9374.867 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75198 , gadget_id = 73065003 , pos = { x = 2058.808, y = 291.274, z = 9320.849 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 75199 , gadget_id = 73065003 , pos = { x = 2058.198, y = 289.755, z = 9320.092 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 75206 , gadget_id = 73065003 , pos = { x = 2075.245, y = 287.663, z = 9376.352 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75290 , gadget_id = 73045151 , pos = { x = 2059.104, y = 288.479, z = 9321.426 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 75291 , gadget_id = 73045151 , pos = { x = 2058.37, y = 288.11, z = 9320.43 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 75298 , gadget_id = 73045151 , pos = { x = 2076.037, y = 286.958, z = 9376.855 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75299 , gadget_id = 73045151 , pos = { x = 2075.771, y = 287.475, z = 9376.118 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75311 , gadget_id = 73045226 , pos = { x = 2301.314, y = 202.622, z = 9441.965 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75312 , gadget_id = 73045226 , pos = { x = 2299.953, y = 200.928, z = 9452.155 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75323 , gadget_id = 73045226 , pos = { x = 2300.779, y = 203.145, z = 9440.919 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75326 , gadget_id = 73045226 , pos = { x = 2248.934, y = 269.712, z = 9223.704 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75327 , gadget_id = 73045226 , pos = { x = 2249.345, y = 269.776, z = 9224.258 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75328 , gadget_id = 73045226 , pos = { x = 2240.827, y = 261.484, z = 9244.617 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75329 , gadget_id = 73045226 , pos = { x = 2239.685, y = 263.27, z = 9240.271 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75330 , gadget_id = 73045226 , pos = { x = 2240.769, y = 263.101, z = 9241.775 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75331 , gadget_id = 73045226 , pos = { x = 2245.982, y = 266.263, z = 9234.663 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75332 , gadget_id = 73045226 , pos = { x = 2240.118, y = 264.03, z = 9240.067 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75333 , gadget_id = 73045226 , pos = { x = 2236.771, y = 265.616, z = 9235.136 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75335 , gadget_id = 73045226 , pos = { x = 2242.239, y = 268.644, z = 9225.477 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75336 , gadget_id = 73045226 , pos = { x = 2234.957, y = 262.274, z = 9243.621 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75337 , gadget_id = 73045226 , pos = { x = 2221.998, y = 278.236, z = 9234.303 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75338 , gadget_id = 73065004 , pos = { x = 2222.244, y = 279.675, z = 9234.36 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 75340 , gadget_id = 73065004 , pos = { x = 2142.254, y = 220.742, z = 9384.644 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 75156,75157,75168,75171,75172,75173,75174,75175,75176,75177,75178,75180,75181,75189,75192,75198,75199,75206,75290,75291,75298,75299,75311,75312,75323,75326,75327,75328,75329,75330,75331,75332,75333,75335,75336,75337,75338,75340 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
