-- 基础信息
local base_info = {
	group_id = 133606019
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 19001 , monster_id = 21010901 , pos = { x = 1809.432, y = 202.253, z = 10575.57 } , rot = { x = 0, y = 73.456, z = 0 } , level = 90 , title_id = 3011, special_name_id = 2300101 },
	{ config_id = 19004 , monster_id = 21020101 , pos = { x = 1816.221, y = 202.292, z = 10579.8 } , rot = { x = 0, y = 199.624, z = 0 } , level = 90 , title_id = 3101, special_name_id = 2310120 },
	{ config_id = 19005 , monster_id = 21010901 , pos = { x = 1817.582, y = 206.806, z = 10588.35 } , rot = { x = 0, y = 190.13, z = 0 } , level = 90 , title_id = 3011, special_name_id = 2300101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 19001,19004,19005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
