-- 基础信息
local base_info = {
	group_id = 133605016
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 16004 , monster_id = 20080301 , pos = { x = 2794.878, y = 256.442, z = 9159.953 } , rot = { x = 0, y = 120, z = 0 } , level = 88 , title_id = 2233, special_name_id = 2223501 },
	{ config_id = 16005 , monster_id = 20011201 , pos = { x = 2798.984, y = 256.333, z = 9162.854 } , rot = { x = 0, y = 109.483, z = 0 } , level = 88 , title_id = 1006, special_name_id = 2100101 },
	{ config_id = 16006 , monster_id = 20011201 , pos = { x = 2802.83, y = 254.853, z = 9156.264 } , rot = { x = 0, y = 3.558, z = 0 } , level = 88 , title_id = 1006, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 16004,16005,16006 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
