-- 基础信息
local base_info = {
	group_id = 133611102
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 102001 , monster_id = 22140101 , pos = { x = 6355.009, y = 305.686, z = 9596.911 } , rot = { x = 0, y = 323.062, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 102002 , monster_id = 22140101 , pos = { x = 6355.495, y = 304.799, z = 9607.052 } , rot = { x = 0, y = 206.821, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 102003 , monster_id = 22140101 , pos = { x = 6350.629, y = 304.086, z = 9600.438 } , rot = { x = 0, y = 49.749, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 },
	{ config_id = 102004 , monster_id = 22140101 , pos = { x = 6349.861, y = 302.972, z = 9607.828 } , rot = { x = 0, y = 130.992, z = 0 } , level = 93 , title_id = 4090, special_name_id = 2408901 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 102005 , gadget_id = 70211002 , pos = { x = 6360.869, y = 307.217, z = 9597.925 } , rot = { x = 0, y = 297.418, z = 0 } , level = 88 },
	{ config_id = 102008 , gadget_id = 42215010 , pos = { x = 6356.512, y = 305.916, z = 9597.772 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 102009 , gadget_id = 73070030 , pos = { x = 6422.743, y = 330.97, z = 9600.218 } , rot = { x = 350.114, y = 0, z = 0 } , level = 93 },
	{ config_id = 102010 , gadget_id = 73070030 , pos = { x = 6257.011, y = 221.894, z = 9627.841 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 102001,102002,102003,102004 },
		gadgets = { 102005,102008,102009,102010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
