-- 基础信息
local base_info = {
	group_id = 133601214
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 214001 , monster_id = 23072101 , pos = { x = 2841.191, y = 204.38, z = 9974.671 } , rot = { x = 0, y = 123, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 214004 , monster_id = 23075101 , pos = { x = 2840.125, y = 204.38, z = 9973.026 } , rot = { x = 0, y = 123, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 214005 , monster_id = 23075101 , pos = { x = 2842.274, y = 204.38, z = 9976.335 } , rot = { x = 0, y = 123, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741401 },
	{ config_id = 214006 , monster_id = 23079202 , pos = { x = 2845.838, y = 204.394, z = 9972.401 } , rot = { x = 0, y = 302.065, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741801 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 214007 , gadget_id = 42308099 , pos = { x = 2834.085, y = 205.514, z = 9978.881 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 214001,214004,214005,214006 },
		gadgets = { 214007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
