-- 基础信息
local base_info = {
	group_id = 133604086
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 86001 , monster_id = 23070101 , pos = { x = 2247.395, y = 202.323, z = 9547.063 } , rot = { x = 0, y = 57.674, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 86002 , monster_id = 23072101 , pos = { x = 2246.586, y = 201.889, z = 9548.766 } , rot = { x = 0, y = 71.931, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 86008 , monster_id = 23079202 , pos = { x = 2249.919, y = 202.834, z = 9546.134 } , rot = { x = 0, y = 57.674, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741801 },
	{ config_id = 86009 , monster_id = 23077102 , pos = { x = 2250.086, y = 202.455, z = 9543.447 } , rot = { x = 0, y = 45.357, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 86010 , gadget_id = 42308099 , pos = { x = 2248.354, y = 202.406, z = 9547.677 } , rot = { x = 0, y = 0, z = 0 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 86001,86002,86008,86009 },
		gadgets = { 86010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
