-- 基础信息
local base_info = {
	group_id = 133601065
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 65001 , monster_id = 23085101 , pos = { x = 3099.279, y = 212.293, z = 9507.911 } , rot = { x = 0, y = 320.307, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742601 },
	{ config_id = 65004 , monster_id = 23085101 , pos = { x = 3085.572, y = 207.454, z = 9496.517 } , rot = { x = 0, y = 141.297, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742601 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 65011 , gadget_id = 42308099 , pos = { x = 3090.289, y = 212.229, z = 9512.875 } , rot = { x = 0, y = 0, z = 0 } , level = 91 },
	{ config_id = 65014 , gadget_id = 70294074 , pos = { x = 3099.935, y = 215.441, z = 9513.354 } , rot = { x = 0, y = 230, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 65001,65004 },
		gadgets = { 65011,65014 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
