-- 基础信息
local base_info = {
	group_id = 133605018
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 18001 , monster_id = 26300301 , pos = { x = 2213.406, y = 265.6, z = 9040.724 } , rot = { x = 0, y = 165.589, z = 0 } , level = 88 , title_id = 8136, special_name_id = 2813801 },
	{ config_id = 18004 , monster_id = 20011001 , pos = { x = 2221.779, y = 265.6, z = 9037.566 } , rot = { x = 0, y = 247.182, z = 0 } , level = 88 , title_id = 1005, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 18001,18004 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
