-- 基础信息
local base_info = {
	group_id = 133601043
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 43001 , monster_id = 23079301 , pos = { x = 3029.088, y = 204.242, z = 9365.394 } , rot = { x = 0, y = 101.517, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741901 },
	{ config_id = 43002 , monster_id = 23070101 , pos = { x = 3028.149, y = 204.242, z = 9360.958 } , rot = { x = 0, y = 282.058, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 43004 , gadget_id = 42308099 , pos = { x = 3028.557, y = 204.242, z = 9365.81 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 43001,43002 },
		gadgets = { 43004 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
