-- 基础信息
local base_info = {
	group_id = 133606147
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 147121 , gadget_id = 73065004 , pos = { x = 1614.829, y = 202.738, z = 11119.6 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147122 , gadget_id = 73065004 , pos = { x = 1645.512, y = 201.986, z = 11107.48 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147123 , gadget_id = 73065004 , pos = { x = 1633.217, y = 202.18, z = 11106.1 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147124 , gadget_id = 73065004 , pos = { x = 1657.161, y = 204.081, z = 11122.59 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147127 , gadget_id = 73065004 , pos = { x = 1643.289, y = 207.357, z = 11081.08 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147128 , gadget_id = 73065004 , pos = { x = 1640.677, y = 206.063, z = 11071.5 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147131 , gadget_id = 73065004 , pos = { x = 1617.68, y = 195.837, z = 11086.89 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147132 , gadget_id = 73065004 , pos = { x = 1622.075, y = 197.785, z = 11083.1 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147133 , gadget_id = 73065004 , pos = { x = 1619.759, y = 196.009, z = 11083.66 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147134 , gadget_id = 73065004 , pos = { x = 1621.206, y = 196.136, z = 11083.75 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147135 , gadget_id = 73065004 , pos = { x = 1642.127, y = 207.232, z = 11081.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147136 , gadget_id = 73065004 , pos = { x = 1619.248, y = 195.57, z = 11086.56 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147137 , gadget_id = 73065004 , pos = { x = 1621.685, y = 197.159, z = 11089.92 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147138 , gadget_id = 73065004 , pos = { x = 1629.535, y = 200.056, z = 11089.95 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147139 , gadget_id = 73065004 , pos = { x = 1591.169, y = 195.68, z = 11119.66 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147140 , gadget_id = 73065004 , pos = { x = 1595.943, y = 197.474, z = 11126.7 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147141 , gadget_id = 73065004 , pos = { x = 1595.954, y = 196.783, z = 11125.88 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147142 , gadget_id = 73065004 , pos = { x = 1632.252, y = 203.845, z = 11049.02 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147143 , gadget_id = 73065004 , pos = { x = 1628.866, y = 204.496, z = 11075.79 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147144 , gadget_id = 73065004 , pos = { x = 1625.919, y = 198.901, z = 11083.82 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147145 , gadget_id = 73065004 , pos = { x = 1628.568, y = 203.538, z = 11077.66 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147146 , gadget_id = 73065004 , pos = { x = 1605.408, y = 182.887, z = 11074.85 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147147 , gadget_id = 73065004 , pos = { x = 1600.073, y = 182.391, z = 11067.38 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147148 , gadget_id = 73065004 , pos = { x = 1600.737, y = 182.508, z = 11076.06 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147149 , gadget_id = 73065004 , pos = { x = 1594.671, y = 181.855, z = 11068.5 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147150 , gadget_id = 73065004 , pos = { x = 1600.93, y = 181.761, z = 11073.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147161 , gadget_id = 73065004 , pos = { x = 1671.514, y = 203.09, z = 11110.3 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147164 , gadget_id = 73065004 , pos = { x = 1591.335, y = 203.993, z = 11033.32 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147165 , gadget_id = 73065004 , pos = { x = 1593.633, y = 203.9, z = 11034.05 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147166 , gadget_id = 73065004 , pos = { x = 1574.981, y = 203.067, z = 11030.42 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147170 , gadget_id = 73065004 , pos = { x = 1611.682, y = 204.152, z = 11119.41 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147171 , gadget_id = 73065004 , pos = { x = 1645.633, y = 202.965, z = 11105.39 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147174 , gadget_id = 73065004 , pos = { x = 1640.213, y = 206.882, z = 11070.11 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147176 , gadget_id = 73065004 , pos = { x = 1618.617, y = 197.032, z = 11087.71 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147177 , gadget_id = 73065004 , pos = { x = 1600.73, y = 182.927, z = 11075.18 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147182 , gadget_id = 73065004 , pos = { x = 1590.846, y = 205.431, z = 11033.65 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147230 , gadget_id = 73045226 , pos = { x = 1614.568, y = 201.159, z = 11119.52 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147231 , gadget_id = 73045226 , pos = { x = 1645.226, y = 200.307, z = 11107.42 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147232 , gadget_id = 73045226 , pos = { x = 1632.94, y = 200.5, z = 11106.02 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147233 , gadget_id = 73045226 , pos = { x = 1656.921, y = 202.397, z = 11122.48 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147236 , gadget_id = 73045226 , pos = { x = 1642.987, y = 205.681, z = 11081.01 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147237 , gadget_id = 73045226 , pos = { x = 1640.385, y = 204.53, z = 11071.47 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147240 , gadget_id = 73045226 , pos = { x = 1617.492, y = 194.237, z = 11086.63 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147241 , gadget_id = 73045226 , pos = { x = 1621.809, y = 196.103, z = 11083.03 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147242 , gadget_id = 73045226 , pos = { x = 1619.564, y = 194.78, z = 11083.6 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147243 , gadget_id = 73045226 , pos = { x = 1621.072, y = 195.295, z = 11083.73 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147244 , gadget_id = 73045226 , pos = { x = 1641.943, y = 206.11, z = 11081.43 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147245 , gadget_id = 73045226 , pos = { x = 1619.113, y = 194.729, z = 11086.53 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147246 , gadget_id = 73045226 , pos = { x = 1621.538, y = 196.233, z = 11089.87 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147247 , gadget_id = 73045226 , pos = { x = 1629.361, y = 198.86, z = 11089.91 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147248 , gadget_id = 73045226 , pos = { x = 1590.961, y = 194.482, z = 11119.61 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147249 , gadget_id = 73045226 , pos = { x = 1595.664, y = 195.898, z = 11126.64 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147250 , gadget_id = 73045226 , pos = { x = 1595.821, y = 195.942, z = 11125.84 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147251 , gadget_id = 73045226 , pos = { x = 1632.033, y = 202.656, z = 11049 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147252 , gadget_id = 73045226 , pos = { x = 1628.574, y = 202.963, z = 11075.76 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147253 , gadget_id = 73045226 , pos = { x = 1625.685, y = 197.713, z = 11083.79 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147254 , gadget_id = 73045226 , pos = { x = 1628.348, y = 202.33, z = 11077.62 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147255 , gadget_id = 73045226 , pos = { x = 1605.203, y = 181.56, z = 11074.8 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147256 , gadget_id = 73045226 , pos = { x = 1599.841, y = 180.877, z = 11067.3 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147257 , gadget_id = 73045226 , pos = { x = 1600.477, y = 180.825, z = 11075.99 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147258 , gadget_id = 73045226 , pos = { x = 1594.462, y = 180.656, z = 11068.45 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147259 , gadget_id = 73045226 , pos = { x = 1600.79, y = 180.808, z = 11073.29 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147270 , gadget_id = 73045226 , pos = { x = 1671.217, y = 201.413, z = 11110.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147273 , gadget_id = 73045226 , pos = { x = 1591.019, y = 202.32, z = 11033.23 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147274 , gadget_id = 73045226 , pos = { x = 1593.388, y = 202.624, z = 11033.98 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147275 , gadget_id = 73045226 , pos = { x = 1574.74, y = 201.75, z = 11030.36 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147279 , gadget_id = 73045226 , pos = { x = 1611.915, y = 201.63, z = 11119.86 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147280 , gadget_id = 73045226 , pos = { x = 1645.865, y = 200.302, z = 11105.79 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147283 , gadget_id = 73045226 , pos = { x = 1640.454, y = 204.505, z = 11070.52 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147285 , gadget_id = 73045226 , pos = { x = 1618.824, y = 194.932, z = 11088.09 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147286 , gadget_id = 73045226 , pos = { x = 1600.957, y = 180.6, z = 11075.6 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 147291 , gadget_id = 73045226 , pos = { x = 1591.116, y = 202.66, z = 11034.16 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 147121,147122,147123,147124,147127,147128,147131,147132,147133,147134,147135,147136,147137,147138,147139,147140,147141,147142,147143,147144,147145,147146,147147,147148,147149,147150,147161,147164,147165,147166,147170,147171,147174,147176,147177,147182,147230,147231,147232,147233,147236,147237,147240,147241,147242,147243,147244,147245,147246,147247,147248,147249,147250,147251,147252,147253,147254,147255,147256,147257,147258,147259,147270,147273,147274,147275,147279,147280,147283,147285,147286,147291 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
