-- 基础信息
local base_info = {
	group_id = 133604087
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 87001 , monster_id = 23079302 , pos = { x = 2254.814, y = 201.223, z = 9471.098 } , rot = { x = 0, y = 120.203, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741901 },
	{ config_id = 87002 , monster_id = 23072101 , pos = { x = 2257.896, y = 201.887, z = 9469.743 } , rot = { x = 0, y = 302.085, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 87003 , monster_id = 23072101 , pos = { x = 2256.805, y = 201.672, z = 9468.228 } , rot = { x = 0, y = 310.346, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741201 },
	{ config_id = 87004 , monster_id = 23070101 , pos = { x = 2251.938, y = 201.04, z = 9476.474 } , rot = { x = 0, y = 340.001, z = 0 } , level = 88 , title_id = 7411, special_name_id = 2741101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 87010 , gadget_id = 42308099 , pos = { x = 2255.717, y = 201.798, z = 9468.965 } , rot = { x = 0, y = 0, z = 0 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 87001,87002,87003,87004 },
		gadgets = { 87010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
