-- 基础信息
local base_info = {
	group_id = 133604050
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 50020 , gadget_id = 73065004 , pos = { x = 2250.048, y = 205.056, z = 9485.342 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50021 , gadget_id = 73065004 , pos = { x = 2230.541, y = 202.356, z = 9493.06 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50022 , gadget_id = 73065004 , pos = { x = 2229.206, y = 203.458, z = 9473.286 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50024 , gadget_id = 73065004 , pos = { x = 2185.316, y = 205.011, z = 9482.737 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50025 , gadget_id = 73065004 , pos = { x = 2181.35, y = 203.539, z = 9481.542 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50026 , gadget_id = 73065004 , pos = { x = 2249.216, y = 205.431, z = 9483.977 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50027 , gadget_id = 73065004 , pos = { x = 2246.746, y = 202.822, z = 9501.246 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50028 , gadget_id = 73065004 , pos = { x = 2185.182, y = 204.544, z = 9481.637 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50036 , gadget_id = 73045226 , pos = { x = 2249.821, y = 203.729, z = 9485.284 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50037 , gadget_id = 73045226 , pos = { x = 2230.33, y = 201.085, z = 9493 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50038 , gadget_id = 73045226 , pos = { x = 2229.004, y = 202.241, z = 9473.229 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50040 , gadget_id = 73045226 , pos = { x = 2185.116, y = 203.739, z = 9482.668 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50041 , gadget_id = 73045226 , pos = { x = 2181.139, y = 202.268, z = 9481.481 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50042 , gadget_id = 73045226 , pos = { x = 2249.41, y = 203.739, z = 9484.25 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50043 , gadget_id = 73045226 , pos = { x = 2246.94, y = 201.13, z = 9501.52 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 50044 , gadget_id = 73045226 , pos = { x = 2185.376, y = 202.852, z = 9481.91 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 50020,50021,50022,50024,50025,50026,50027,50028,50036,50037,50038,50040,50041,50042,50043,50044 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
