-- 基础信息
local base_info = {
	group_id = 133611005
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 5002 , gadget_id = 73070024 , pos = { x = 5395.942, y = 226.184, z = 9572.74 } , rot = { x = 0, y = 311.286, z = 0 } , level = 93 },
	{ config_id = 5010 , gadget_id = 73070001 , pos = { x = 5405.849, y = 227.185, z = 9566.454 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5011 , gadget_id = 73070001 , pos = { x = 5406.876, y = 228.222, z = 9564.359 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5022 , gadget_id = 73019150 , pos = { x = 5405.625, y = 221.113, z = 9564.3 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5023 , gadget_id = 73070011 , pos = { x = 5413.19, y = 225.27, z = 9579.215 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5024 , gadget_id = 73070011 , pos = { x = 5401.654, y = 227.659, z = 9564.592 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5025 , gadget_id = 73070011 , pos = { x = 5402.372, y = 227.129, z = 9566.212 } , rot = { x = 0, y = 264.91, z = 0 } , level = 93 },
	{ config_id = 5026 , gadget_id = 73019150 , pos = { x = 5405.368, y = 221.113, z = 9566.054 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5027 , gadget_id = 73070001 , pos = { x = 5407.03, y = 227.011, z = 9567.265 } , rot = { x = 339.991, y = 180, z = 180 } , level = 93 },
	{ config_id = 5029 , gadget_id = 73070001 , pos = { x = 5405.715, y = 227.497, z = 9565.781 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5030 , gadget_id = 73070001 , pos = { x = 5404.264, y = 229.256, z = 9563.446 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5031 , gadget_id = 73070001 , pos = { x = 5409.365, y = 225.387, z = 9572.401 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5035 , gadget_id = 73070003 , pos = { x = 5407.083, y = 227.175, z = 9566.831 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5036 , gadget_id = 73074096 , pos = { x = 5407.083, y = 227.361, z = 9566.831 } , rot = { x = 0, y = 0, z = 0 } , level = 93 },
	{ config_id = 5038 , gadget_id = 73070011 , pos = { x = 5402.372, y = 227.129, z = 9566.212 } , rot = { x = 0, y = 264.91, z = 0 } , level = 93 },
	{ config_id = 5039 , gadget_id = 73124021 , pos = { x = 5404.553, y = 227.315, z = 9566.001 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 5002,5010,5011,5022,5023,5024,5025,5026,5027,5029,5030,5031,5035,5036,5038,5039 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
