-- 基础信息
local base_info = {
	group_id = 133601275
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 275001 , monster_id = 23070102 , pos = { x = 3546.189, y = 247.93, z = 9882.406 } , rot = { x = 0, y = 1.202, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741101 },
	{ config_id = 275002 , monster_id = 23073101 , pos = { x = 3547.377, y = 247.93, z = 9884.115 } , rot = { x = 0, y = 204.892, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741301 },
	{ config_id = 275003 , monster_id = 23076101 , pos = { x = 3569.027, y = 248.625, z = 9873.021 } , rot = { x = 0, y = 234.807, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741501 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 275001,275002,275003 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
