-- 基础信息
local base_info = {
	group_id = 133601327
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 327001 , monster_id = 22130103 , pos = { x = 2018.863, y = 223.954, z = 9228.426 } , rot = { x = 0, y = 36.698, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 327003 , monster_id = 22130104 , pos = { x = 2025.032, y = 220.829, z = 9225.675 } , rot = { x = 0, y = 322.675, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 327004 , monster_id = 22130001 , pos = { x = 2025.044, y = 222.724, z = 9230.346 } , rot = { x = 0, y = 262.781, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 327005 , monster_id = 22130202 , pos = { x = 2026.017, y = 220.621, z = 9226.043 } , rot = { x = 0, y = 0, z = 0 } , level = 89 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 327006 , gadget_id = 73073027 , pos = { x = 2021.377, y = 230.339, z = 9236.814 } , rot = { x = 317.226, y = 79.333, z = 305.678 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 327001,327003,327004,327005 },
		gadgets = { 327006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
