-- 基础信息
local base_info = {
	group_id = 133607025
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 25004 , monster_id = 20080201 , pos = { x = 1690.558, y = 225.738, z = 10052.94 } , rot = { x = 0, y = 106.25, z = 0 } , level = 89 , title_id = 2233, special_name_id = 2223401 },
	{ config_id = 25005 , monster_id = 20010101 , pos = { x = 1695.026, y = 226.105, z = 10052.62 } , rot = { x = 0, y = 30.239, z = 0 } , level = 89 , title_id = 1001, special_name_id = 2100101 },
	{ config_id = 25006 , monster_id = 20010101 , pos = { x = 1694.38, y = 225.946, z = 10053.94 } , rot = { x = 0, y = 325.296, z = 0 } , level = 89 , title_id = 1001, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 25007 , gadget_id = 70220109 , pos = { x = 1697.972, y = 225.952, z = 10054.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 25008 , gadget_id = 70220109 , pos = { x = 1693.664, y = 225.611, z = 10048.58 } , rot = { x = 0, y = 316.874, z = 0 } , level = 89 },
	{ config_id = 25010 , gadget_id = 70331131 , pos = { x = 1692.814, y = 227.126, z = 10057.18 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 25004,25005,25006 },
		gadgets = { 25007,25008,25010 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
