-- 基础信息
local base_info = {
	group_id = 133605098
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 98055 , gadget_id = 73065003 , pos = { x = 2849.52, y = 235.392, z = 9149.065 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98056 , gadget_id = 73065003 , pos = { x = 2840.045, y = 235.804, z = 9141.899 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98057 , gadget_id = 73065003 , pos = { x = 2850.08, y = 234.785, z = 9148.24 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98058 , gadget_id = 73065003 , pos = { x = 2850.613, y = 235.951, z = 9145.642 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98059 , gadget_id = 73065003 , pos = { x = 2847.835, y = 233.364, z = 9157.069 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98060 , gadget_id = 73065003 , pos = { x = 2851.22, y = 236.211, z = 9147.999 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98061 , gadget_id = 73065003 , pos = { x = 2851.04, y = 236.431, z = 9146.04 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98081 , gadget_id = 73045151 , pos = { x = 2849.785, y = 232.821, z = 9149.54 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98082 , gadget_id = 73045151 , pos = { x = 2840.32, y = 233.46, z = 9142.34 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98083 , gadget_id = 73045151 , pos = { x = 2850.348, y = 232.216, z = 9148.722 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98084 , gadget_id = 73045151 , pos = { x = 2850.903, y = 233.381, z = 9146.106 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98085 , gadget_id = 73045151 , pos = { x = 2848.11, y = 231.02, z = 9157.51 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98086 , gadget_id = 73045151 , pos = { x = 2851.494, y = 233.641, z = 9148.472 } , rot = { x = 0, y = 0, z = 0 } , level = 90 },
	{ config_id = 98087 , gadget_id = 73045151 , pos = { x = 2851.396, y = 233.46, z = 9147.372 } , rot = { x = 0, y = 0, z = 0 } , level = 90 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 98055,98056,98057,98058,98059,98060,98061,98081,98082,98083,98084,98085,98086,98087 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
