-- 基础信息
local base_info = {
	group_id = 133601109
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 109004 , monster_id = 23085301 , pos = { x = 2872.902, y = 201.945, z = 9202.719 } , rot = { x = 0, y = 58.599, z = 0 } , level = 88 , title_id = 7421, special_name_id = 2742801 },
	{ config_id = 109005 , monster_id = 23080402 , pos = { x = 2875.6, y = 201.872, z = 9196.023 } , rot = { x = 0, y = 65.136, z = 0 } , level = 88 , title_id = 7421, special_name_id = 2742401 },
	{ config_id = 109006 , monster_id = 23080402 , pos = { x = 2874.442, y = 201.81, z = 9198.526 } , rot = { x = 0, y = 65.136, z = 0 } , level = 88 , title_id = 7421, special_name_id = 2742401 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 109007 , gadget_id = 42308099 , pos = { x = 2874.363, y = 201.857, z = 9199.389 } , rot = { x = 0, y = 0, z = 0 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 109004,109005,109006 },
		gadgets = { 109007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
