-- 基础信息
local base_info = {
	group_id = 133611034
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 34003 , monster_id = 22130101 , pos = { x = 5550.933, y = 226.608, z = 9614.288 } , rot = { x = 0, y = 176.579, z = 0 } , level = 88 , title_id = 4087, special_name_id = 2408701 },
	{ config_id = 34004 , monster_id = 22130101 , pos = { x = 5548.496, y = 226.472, z = 9614.142 } , rot = { x = 0, y = 144.693, z = 0 } , level = 88 , title_id = 4087, special_name_id = 2408701 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 34006 , gadget_id = 70211012 , pos = { x = 5564.833, y = 229.132, z = 9616.829 } , rot = { x = 21.65, y = 234.155, z = 9.285 } , level = 88 },
	{ config_id = 34007 , gadget_id = 73010027 , pos = { x = 5550.56, y = 226.454, z = 9611.674 } , rot = { x = 0, y = 0, z = 0 } , level = 93 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 34003,34004 },
		gadgets = { 34006,34007 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
