-- 基础信息
local base_info = {
	group_id = 133611249
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 249003 , monster_id = 21010101 , pos = { x = 5638.92, y = 228.361, z = 9897.658 } , rot = { x = 0, y = 314.931, z = 0 } , level = 90 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 249004 , monster_id = 21010101 , pos = { x = 5635.248, y = 227.708, z = 9897.141 } , rot = { x = 0, y = 29.556, z = 0 } , level = 90 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 249006 , monster_id = 21010101 , pos = { x = 5638.051, y = 228.031, z = 9903.389 } , rot = { x = 0, y = 209.261, z = 0 } , level = 90 , title_id = 3001, special_name_id = 2300101 },
	{ config_id = 249007 , monster_id = 22010101 , pos = { x = 5633.061, y = 226.881, z = 9899.838 } , rot = { x = 0, y = 76.167, z = 0 } , level = 90 , title_id = 4001, special_name_id = 2400118 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 249005 , gadget_id = 70300107 , pos = { x = 5636.627, y = 227.627, z = 9900.162 } , rot = { x = 0, y = 0.214, z = 0 } , level = 93 },
	{ config_id = 249009 , gadget_id = 70211151 , pos = { x = 5639.702, y = 228.492, z = 9900.533 } , rot = { x = 13.966, y = 281.915, z = 357.591 } , level = 88 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 249003,249004,249006,249007 },
		gadgets = { 249005,249009 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
