-- 基础信息
local base_info = {
	group_id = 133604072
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 72003 , monster_id = 20010601 , pos = { x = 2611.403, y = 357.722, z = 9280.256 } , rot = { x = 0, y = 216.845, z = 0 } , level = 88 , title_id = 1031, special_name_id = 2100101 },
	{ config_id = 72004 , monster_id = 20010501 , pos = { x = 2621.223, y = 361.956, z = 9285.769 } , rot = { x = 0, y = 211.425, z = 0 } , level = 88 , title_id = 1003, special_name_id = 2100101 },
	{ config_id = 72005 , monster_id = 20010501 , pos = { x = 2615.392, y = 359.334, z = 9294.03 } , rot = { x = 0, y = 206.069, z = 0 } , level = 88 , title_id = 1003, special_name_id = 2100101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {

}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 72003,72004,72005 },
		gadgets = {  },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
