-- 基础信息
local base_info = {
	group_id = 133601238
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 238001 , monster_id = 23080102 , pos = { x = 3134.434, y = 204.19, z = 9733.389 } , rot = { x = 0, y = 230, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 },
	{ config_id = 238002 , monster_id = 23078102 , pos = { x = 3133.17, y = 204.19, z = 9733.54 } , rot = { x = 0, y = 100.668, z = 0 } , level = 91 , title_id = 7411, special_name_id = 2741601 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 238003 , gadget_id = 42308099 , pos = { x = 3135.605, y = 204.19, z = 9732.274 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 238001,238002 },
		gadgets = { 238003 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
