-- 基础信息
local base_info = {
	group_id = 133601290
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {
	{ config_id = 290001 , monster_id = 23080501 , pos = { x = 3355.544, y = 235.61, z = 9584.566 } , rot = { x = 0, y = 175.625, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 290004 , monster_id = 23080501 , pos = { x = 3352.357, y = 235.594, z = 9584.324 } , rot = { x = 0, y = 175.625, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742501 },
	{ config_id = 290005 , monster_id = 23080102 , pos = { x = 3354.753, y = 235.599, z = 9577.125 } , rot = { x = 0, y = 355.625, z = 0 } , level = 91 , title_id = 7421, special_name_id = 2742101 }
}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 290006 , gadget_id = 42308099 , pos = { x = 3354.526, y = 235.097, z = 9580.549 } , rot = { x = 0, y = 0, z = 0 } , level = 91 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = { 290001,290004,290005 },
		gadgets = { 290006 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
