-- 基础信息
local base_info = {
	group_id = 133607228
}

--================================================================
--
-- 配置 抓取仅位置
--
--================================================================

-- 怪物
monsters = {

}

-- NPC
npcs = {
}

-- 装置
gadgets = {
	{ config_id = 228196 , gadget_id = 73065004 , pos = { x = 1727.035, y = 207.661, z = 9652.124 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228197 , gadget_id = 73065004 , pos = { x = 1721.648, y = 206.656, z = 9664.514 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228198 , gadget_id = 73065004 , pos = { x = 1721.153, y = 205.664, z = 9663.07 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228199 , gadget_id = 73065004 , pos = { x = 1683.111, y = 205.66, z = 9687.783 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228200 , gadget_id = 73065004 , pos = { x = 1644.013, y = 214.79, z = 9654.615 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228201 , gadget_id = 73065004 , pos = { x = 1645.691, y = 215.05, z = 9659.572 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228203 , gadget_id = 73065004 , pos = { x = 1731.332, y = 207.975, z = 9650.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228204 , gadget_id = 73065004 , pos = { x = 1786.623, y = 220.273, z = 9640.984 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228205 , gadget_id = 73065004 , pos = { x = 1772.541, y = 217.849, z = 9644.133 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228207 , gadget_id = 73065004 , pos = { x = 1737.859, y = 210.773, z = 9647.085 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228208 , gadget_id = 73065004 , pos = { x = 1676.021, y = 205.892, z = 9687.484 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228209 , gadget_id = 73065004 , pos = { x = 1658.607, y = 204.379, z = 9719.614 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228212 , gadget_id = 73065004 , pos = { x = 1687.097, y = 201.343, z = 9668.714 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228215 , gadget_id = 73065004 , pos = { x = 1691.676, y = 202.743, z = 9659.363 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228216 , gadget_id = 73065004 , pos = { x = 1691.691, y = 201.888, z = 9660.437 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228220 , gadget_id = 73065004 , pos = { x = 1644.694, y = 215.752, z = 9653.19 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228221 , gadget_id = 73065004 , pos = { x = 1682.47, y = 206.74, z = 9688.968 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228222 , gadget_id = 73065004 , pos = { x = 1726.743, y = 208.135, z = 9660.279 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228223 , gadget_id = 73065004 , pos = { x = 1625.892, y = 206.367, z = 9701.414 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228224 , gadget_id = 73065004 , pos = { x = 1625.064, y = 207.395, z = 9701.104 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228225 , gadget_id = 73065004 , pos = { x = 1630.527, y = 202.77, z = 9703.864 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228231 , gadget_id = 73065004 , pos = { x = 1732.406, y = 209.862, z = 9648.54 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228232 , gadget_id = 73065004 , pos = { x = 1787.357, y = 220.879, z = 9640.012 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228234 , gadget_id = 73065004 , pos = { x = 1659.533, y = 211.081, z = 9654.727 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228236 , gadget_id = 73065004 , pos = { x = 1667.869, y = 208.08, z = 9653.015 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228241 , gadget_id = 73065004 , pos = { x = 1786.178, y = 231.325, z = 9719.622 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228242 , gadget_id = 73065004 , pos = { x = 1785.433, y = 230.654, z = 9718.178 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228243 , gadget_id = 73065004 , pos = { x = 1781.661, y = 231.766, z = 9702.805 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228246 , gadget_id = 73065004 , pos = { x = 1749.121, y = 183.803, z = 9710.642 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228247 , gadget_id = 73065004 , pos = { x = 1768.55, y = 183.466, z = 9714.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228248 , gadget_id = 73065004 , pos = { x = 1764.215, y = 183.501, z = 9724.443 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228251 , gadget_id = 73065004 , pos = { x = 1749.713, y = 183.666, z = 9711.894 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228252 , gadget_id = 73065004 , pos = { x = 1771.49, y = 183.52, z = 9714.35 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228253 , gadget_id = 73065004 , pos = { x = 1769.653, y = 183.149, z = 9716.237 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228254 , gadget_id = 73065004 , pos = { x = 1768.35, y = 183.635, z = 9727.589 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228260 , gadget_id = 73065003 , pos = { x = 1755.378, y = 255.511, z = 9727.582 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228261 , gadget_id = 73065003 , pos = { x = 1744.593, y = 248.777, z = 9677.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228264 , gadget_id = 73065003 , pos = { x = 1742.977, y = 248.752, z = 9677.913 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228344 , gadget_id = 73045151 , pos = { x = 1744.9, y = 245.99, z = 9678.19 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228347 , gadget_id = 73045151 , pos = { x = 1743.25, y = 245.9, z = 9679.13 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228350 , gadget_id = 73045226 , pos = { x = 1726.817, y = 206.278, z = 9652.094 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228351 , gadget_id = 73045226 , pos = { x = 1721.337, y = 204.98, z = 9664.48 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228352 , gadget_id = 73045226 , pos = { x = 1720.981, y = 204.623, z = 9663.031 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228353 , gadget_id = 73045226 , pos = { x = 1682.862, y = 204.17, z = 9687.72 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228354 , gadget_id = 73045226 , pos = { x = 1644.33, y = 213.695, z = 9654.574 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228355 , gadget_id = 73045226 , pos = { x = 1645.526, y = 213.955, z = 9659.531 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228357 , gadget_id = 73045226 , pos = { x = 1731.07, y = 206.6, z = 9650.63 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228358 , gadget_id = 73045226 , pos = { x = 1786.405, y = 218.891, z = 9640.927 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228359 , gadget_id = 73045226 , pos = { x = 1772.297, y = 216.471, z = 9644.087 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228361 , gadget_id = 73045226 , pos = { x = 1737.59, y = 208.91, z = 9646.97 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228362 , gadget_id = 73045226 , pos = { x = 1675.809, y = 204.395, z = 9687.444 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228363 , gadget_id = 73045226 , pos = { x = 1658.35, y = 202.89, z = 9719.56 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228366 , gadget_id = 73045226 , pos = { x = 1686.886, y = 199.848, z = 9668.779 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228369 , gadget_id = 73045226 , pos = { x = 1691.419, y = 201.06, z = 9659.277 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228370 , gadget_id = 73045226 , pos = { x = 1691.507, y = 200.712, z = 9660.38 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228374 , gadget_id = 73045226 , pos = { x = 1646.688, y = 213.52, z = 9654.109 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228375 , gadget_id = 73045226 , pos = { x = 1682.772, y = 203.805, z = 9689.52 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228376 , gadget_id = 73045226 , pos = { x = 1726.941, y = 206.01, z = 9660.613 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228377 , gadget_id = 73045226 , pos = { x = 1626.184, y = 203.43, z = 9701.96 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228378 , gadget_id = 73045226 , pos = { x = 1625.36, y = 204.458, z = 9701.65 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228379 , gadget_id = 73045226 , pos = { x = 1630.79, y = 200.15, z = 9704.35 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228384 , gadget_id = 73045226 , pos = { x = 1732.682, y = 207.574, z = 9648.892 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228385 , gadget_id = 73045226 , pos = { x = 1787.62, y = 218.35, z = 9640.44 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228387 , gadget_id = 73045226 , pos = { x = 1659.793, y = 208.607, z = 9655.157 } , rot = { x = 0, y = 0, z = 0 } , level = 89 },
	{ config_id = 228389 , gadget_id = 73045226 , pos = { x = 1668.08, y = 206.194, z = 9653.355 } , rot = { x = 0, y = 0, z = 0 } , level = 89 }
}

-- 区域
regions = {
}

-- 触发器
triggers = {
}

-- 变量
variables = {
}

--================================================================
--
-- 初始化配置
--
--================================================================

-- 初始化时创建
init_config = {
	suite = 1,
	end_suite = 0,
	rand_suite = false
}

--================================================================
--
-- 小组配置
--
--================================================================

suites = {
	{
		-- suite_id = 1,
		-- description = ,
		monsters = {  },
		gadgets = { 228196,228197,228198,228199,228200,228201,228203,228204,228205,228207,228208,228209,228212,228215,228216,228220,228221,228222,228223,228224,228225,228231,228232,228234,228236,228241,228242,228243,228246,228247,228248,228251,228252,228253,228254,228260,228261,228264,228344,228347,228350,228351,228352,228353,228354,228355,228357,228358,228359,228361,228362,228363,228366,228369,228370,228374,228375,228376,228377,228378,228379,228384,228385,228387,228389 },
		regions = { },
		triggers = { },
		rand_weight = 100
	}
}
